nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
 *   In this typical use case, the PWM submodule will count the rising edges of the IP bus clock divider by 1.
 *   The PWM_A output will be u16PwmPulse/u16PwmPeriod duty cycle PWM, and PWM_B duty cycle be the half of PWM_A. The
 *   PWM_A output will be disabled when the fault pins 0 of the fault protection channel 0 is activated (active
 *   level be logic 0).
 *    @code
 *        pwm_config_t sPwmConfig = {0};
 *        pwm_sm_config_t sSubmoduleConfig;
 *        pwm_fault_protection_config_t sFaultConfig;
 *        uint16_t u16PwmPeriod, u16PwmPulse;
 *        sPwmConfig.psPwmSubmoduleConfig[0] = &sSubmoduleConfig;
 *        sPwmConfig.psFaultProtectionConfig[0] = &sFaultConfig;
 *        PWM_GetSMDefaultConfig(&sSubmoduleConfig);
 *        PWM_GetFaultProtectionDefaultConfig(&sFaultConfig);
 *        PWM_GetValueConfig(&sSubmoduleConfig.sValRegisterConfig, kPWM_SignedCenterAligned, u16PwmPeriod,
 *                                    u16PwmPulse, (u16PwmPulse / 2));
 *        sPwmSm0Config.sPwmAFaultInputMapping.bFaultInput0Mapping = true;
 *        PWM_Init(PWM, &sPwmConfig);
 *        PWM_EnableCounters(PWM, kPWM_SubModule0Enable);
 *    @endcode
 *
 * 2. Generate a pair of center aligned complementary PWM (PWM_B is inverted PWM_A) signals (with dead time insert).
 *   In this typical use case, the PWM submodule 0 will count the rising edges of the IP bus clock divider by 1.
 *   The PWM_A output will be u16PwmPulse/u16PwmPeriod duty cycle PWM, and PWM_B be the inverted of PWM_A. The dead time
 *   can be inserted before the rising edge of PWM_A/B. The inserted value is in the unit of IP clock cycle and PWM_A/B
 *   can choose to insert different values.
 *    @code
 *        pwm_config_t sPwmConfig = {0};
 *        pwm_sm_config_t sSubmoduleConfig;
 *        uint16_t u16PwmPeriod, u16PwmPulse, u16DeadTime;
 *        sPwmConfig.psPwmSubmoduleConfig[0] = &sSubmoduleConfig;
 *        PWM_GetSMDefaultConfig(&sSubmoduleConfig);
 *        PWM_GetValueConfig(&sSubmoduleConfig.sValRegisterConfig, kPWM_SignedCenterAligned, u16PwmPeriod,
 *                                    u16PwmPulse, u16PwmPulse);
 *        sSubmoduleConfig.sDeadTimeConfig.eMode = kPWM_ComplementaryWithPwmA;
 *        sSubmoduleConfig.sDeadTimeConfig.sDeadTimeValue0.bitsIntegerCycles = u16DeadTime;
 *        sSubmoduleConfig.sDeadTimeConfig.sDeadTimeValue1.bitsIntegerCycles = u16DeadTime;
 *        PWM_Init(PWM, &sPwmConfig);
 *        PWM_EnableCounters(PWM, kPWM_SubModule0Enable);
 *    @endcode
 *
 * 3. Generate phase shifted PWMs
 *   In this typical use case, the PWM submodule 0 will start count the rising edges of the IP bus clock divider by 1.
 *   Submodule 1 count on same clock with submodule 0. And the PWM_A output of submodules 1 be delayed from the output
 *   of submodule 0 with same PWM period and same PWM pulse width.
 *    @code
 *        pwm_config_t sPwmConfig = {0};
 *        pwm_sm_config_t sSubmoduleConfig0, sSubmoduleConfig1;
 *        uint16_t u16PwmPeriod, u16PwmPulse, u16PhaseDelay;
 *        sPwmConfig.psPwmSubmoduleConfig[0] = &sSubmoduleConfig0;
 *        sPwmConfig.psPwmSubmoduleConfig[0] = &sSubmoduleConfig1;
 *        PWM_GetSMDefaultConfig(&sSubmoduleConfig0);
 *        PWM_GetSMDefaultConfig(&sSubmoduleConfig1);
 *        PWM_GetValueConfig(&sSubmoduleConfig.sValRegisterConfig, kPWM_SignedCenterAligned, u16PwmPeriod,
 *                                    u16PwmPulse, u16PwmPulse);
 *        sSubmoduleConfig1.sCounterConfig.eCountClockSource = kPWM_ClockSrcSubmodule0Clock;
 *        sSubmoduleConfig1.sCounterConfig.eCountInitSource = kPWM_InitOnMasterSync;
 *        sSubmoduleConfig1.sCounterConfig.u16PhaseDelayValue = u16PhaseDelay;
 *        PWM_Init(PWM, &sPwmConfig);
 *        PWM_EnableCounters(PWM, kPWM_SubModule0Enable | kPWM_SubModule1Enable);
 *    @endcode
 * @}
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_PWM_DRIVER_VERSION (MAKE_VERSION(2, 0, 0)) /*!< Version 2.0.0 */
/*@}*/

/*!
 * @brief The enumeration for PWM submodule number.
 */
typedef enum _pwm_sm_number
{
    kPWM_SubModule0 = 0U, /*!< PWM Submodule 0 */
    kPWM_SubModule1,      /*!< PWM Submodule 1 */
    kPWM_SubModule2,      /*!< PWM Submodule 2 */
    kPWM_SubModule3       /*!< PWM Submodule 3 */
} pwm_sm_number_t;

/*!
 * @brief The enumeration for PWM submodule enable.
 */
enum _pwm_sm_enable
{
    kPWM_SubModule0Enable = (1U << 0U), /*!< PWM Submodule 0 enable. */
    kPWM_SubModule1Enable = (1U << 1U), /*!< PWM Submodule 1 enable. */
    kPWM_SubModule2Enable = (1U << 2U), /*!< PWM Submodule 2 enable. */
    kPWM_SubModule3Enable = (1U << 3U), /*!< PWM Submodule 3 enable. */
    kPWM_ALLSubModuleEnable =
        (kPWM_SubModule0Enable | kPWM_SubModule1Enable | kPWM_SubModule2Enable | kPWM_SubModule3Enable)
};

/*!
 * @brief The enumeration for PWM submodule clock source.
 */
typedef enum _pwm_sm_count_clock_source
{
    kPWM_ClockSrcBusClock = 0U,  /*!< The IPBus clock is used as the source clock */
    kPWM_ClockSrcExternalClock,  /*!< EXT_CLK is used as the source clock */
    kPWM_ClockSrcSubmodule0Clock /*!< Clock of the submodule 0 (AUX_CLK) is used as the source clock */
} pwm_sm_count_clock_source_t;

/*!
 * @brief The enumeration for PWM submodule prescaler factor selection for clock source.
 */
typedef enum _pwm_sm_count_clock_prescaler
{
    kPWM_ClockPrescaleDivide1 = 0U, /*!< PWM submodule clock frequency = fclk/1 */
    kPWM_ClockPrescaleDivide2,      /*!< PWM submodule clock frequency = fclk/2 */
    kPWM_ClockPrescaleDivide4,      /*!< PWM submodule clock frequency = fclk/4 */
    kPWM_ClockPrescaleDivide8,      /*!< PWM submodule clock frequency = fclk/8 */
    kPWM_ClockPrescaleDivide16,     /*!< PWM submodule clock frequency = fclk/16 */
    kPWM_ClockPrescaleDivide32,     /*!< PWM submodule clock frequency = fclk/32 */
    kPWM_ClockPrescaleDivide64,     /*!< PWM submodule clock frequency = fclk/64 */
    kPWM_ClockPrescaleDivide128     /*!< PWM submodule clock frequency = fclk/128 */
} pwm_sm_count_clock_prescaler_t;

/*!
 * @brief The enumeration for PWM submodule counter initialization options.
 */
typedef enum _pwm_sm_count_init_source
{
    kPWM_InitOnLocalSync = 0U, /*!< Local sync causes initialization */
    kPWM_InitOnMasterReload,   /*!< Master reload from submodule 0 causes initialization */
    kPWM_InitOnMasterSync,     /*!< Master sync from submodule 0 causes initialization */
    kPWM_InitOnExtSync         /*!< EXT_SYNC causes initialization */
} pwm_sm_count_init_source_t;

/*!
 * @brief The structure for configuring PWM submodule counter logic.
 */
typedef struct _pwm_sm_counter_config
{
    pwm_sm_count_clock_source_t eCountClockSource : 2U;       /*!< Configures PWM submodule counter clock source. */
    pwm_sm_count_clock_prescaler_t eCountClockPrescaler : 3U; /*!< Configures PWM submodule counter clock source
                                                                 prescaler. */
    pwm_sm_count_init_source_t eCountInitSource : 2U;         /*!< Configures PWM submodule counter initial source. */

    bool bEnableForceInitial : 1U; /*!< Enable force-controlled initialization. The assert FORCE_OUT signal can to
                                   initialize the counter without regard to the selected initial source. */
    uint16_t u16PhaseDelayValue;   /*!< Defines the delay from the master sync signal of submodule 0 to this submodule
                                      counter (the unit of delay is the PWM clock cycle), only works when chose
                                      kPWM_InitOnMasterSync as initial source. */
} pwm_sm_counter_config_t;

/*!
 * @brief The enumeration for PWM submodule local reload take effect timing.
 */
typedef enum _pwm_sm_reload_signal_select
{
    kPWM_LocalReloadSignal = 0U, /*!<  The local RELOAD signal is used to reload buffered-registers. */
    kPWM_MasterReloadSignal,     /*!< The master RELOAD signal (from submodule 0) is used to reload buffered-registers
                              (should not be used in submodule 0). */
} pwm_sm_reload_signal_select_t;

/*!
 * @brief The enumeration for PWM submodule local reload take effect timing.
 */
typedef enum _pwm_sm_local_reload_effect_timing
{
    kPWM_TakeEffectAtReloadOportunity = 0U, /*!< Buffered-registers reload after one/more reload opportunities, and a
                                             load opportunity can generate on a PWM half or/and full cycle. */
    kPWM_TakeEffectImmediately, /*!< Buffered-registers reload with new values as soon as MCTRL[LDOK] bit is set
                                         when choose local reload. */
} pwm_sm_local_reload_effect_timing_t;

/*!
 * @brief The enumeration for PWM submodule reload opportunities selection under kPWM_ReloadWithLocalReloadOportunity.
 */
typedef enum _pwm_sm_local_reload_oportunity
{
    kPWM_LoadEveryOportunity = 0U, /*!< Every PWM submodule reload opportunity */
    kPWM_LoadEvery2Oportunity,     /*!< Every 2 PWM submodule reload opportunities */
    kPWM_LoadEvery3Oportunity,     /*!< Every 3 PWM submodule reload opportunities */
    kPWM_LoadEvery4Oportunity,     /*!< Every 4 PWM submodule reload opportunities */
    kPWM_LoadEvery5Oportunity,     /*!< Every 5 PWM submodule reload opportunities */
    kPWM_LoadEvery6Oportunity,     /*!< Every 6 PWM submodule reload opportunities */
    kPWM_LoadEvery7Oportunity,     /*!< Every 7 PWM submodule reload opportunities */
    kPWM_LoadEvery8Oportunity,     /*!< Every 8 PWM submodule reload opportunities */
    kPWM_LoadEvery9Oportunity,     /*!< Every 9 PWM submodule reload opportunities */
    kPWM_LoadEvery10Oportunity,    /*!< Every 10 PWM submodule reload opportunities */
    kPWM_LoadEvery11Oportunity,    /*!< Every 11 PWM submodule reload opportunities */
    kPWM_LoadEvery12Oportunity,    /*!< Every 12 PWM submodule reload opportunities */
    kPWM_LoadEvery13Oportunity,    /*!< Every 13 PWM submodule reload opportunities */
    kPWM_LoadEvery14Oportunity,    /*!< Every 14 PWM submodule reload opportunities */
    kPWM_LoadEvery15Oportunity,    /*!< Every 15 PWM submodule reload opportunities */
    kPWM_LoadEvery16Oportunity     /*!< Every 16 PWM submodule reload opportunities */
} pwm_sm_local_reload_oportunity_t;

/*!
 * @brief The structure for configuring PWM submodule reload logic.
 */
typedef struct _pwm_sm_reload_logic_config
{
    pwm_sm_reload_signal_select_t eReloadSignalSelect : 1U; /*!< Configures PWM submodule RELOAD signal source to be
                                                         local reload signal or master reload signal.*/
    pwm_sm_local_reload_effect_timing_t eLoclReloadEffectTime : 1U; /*!< Configures PWM submodule local reload signal
                                                        effective timing when choose it as RELOAD signal source. */
    bool bEnableFullCycleReloadOportunity : 1U; /*!< Enable generate a reload opportunity on PWM half cycle (count from
                                                   INIT value to VAL0). */
    bool bEnableHalfCycleReloadOportunity : 1U; /*!< Enable generate a reload opportunity on PWM full cycle (count from
                                                   INIT value to VAL1). */
    pwm_sm_local_reload_oportunity_t eLocalReloadOportunity : 4U; /*!< Configures PWM submodule reload frequency when
                                                                    using local reload opportunities mode . */
} pwm_sm_reload_logic_config_t;

/*!
 * @brief The enumeration for PWM submodule VALn register compare mode.
 */
typedef enum _pwm_sm_val_compare_mode
{
    kPWM_CompareOnEqual = 0U, /*!< The VALn registers and the PWM counter are compared using an "equal to" method. */
    kPWM_CompareOnEqualOrGreater, /*!< The VALn registers and the PWM counter are compared using an "equal to or
                                     greater than" method. */
} pwm_sm_val_compare_mode_t;

/*!
 * @brief The enumeration for PWM submodule VAL registers.
 */
typedef enum _pwm_sm_val_register
{
    kPWM_VAL0 = 0U, /*!< PWM submodule value register 0. */
    kPWM_VAL1,      /*!< PWM submodule value register 1. */
    kPWM_VAL2,      /*!< PWM submodule value register 2. */
    kPWM_VAL3,      /*!< PWM submodule value register 3. */
    kPWM_VAL4,      /*!< PWM submodule value register 4. */
    kPWM_VAL5       /*!< PWM submodule value register 5. */
} pwm_sm_val_register_t;

/*!
 * @brief The structure for configuring PWM submodule value registers.
 */
typedef struct _pwm_sm_value_register_config
{
    uint16_t u16CounterInitialValue; /*!< Configures PWM submodule counter initial value. */
    uint16_t u16ValRegister0;        /*!< Configures PWM submodule value register 0 (VAL0) value. */
    uint16_t u16ValRegister1;        /*!< Configures PWM submodule value register 1 (VAL1) value. */
    uint16_t u16ValRegister2;        /*!< Configures PWM submodule value register 2 (VAL2) value. */
    uint16_t u16ValRegister3;        /*!< Configures PWM submodule value register 3 (VAL3) value. */
    uint16_t u16ValRegister4;        /*!< Configures PWM submodule value register 4 (VAL4) value. */
    uint16_t u16ValRegister5;        /*!< Configures PWM submodule value register 5 (VAL5) value. */
} pwm_sm_value_register_config_t;

/*!
 * @brief The enumeration for PWM submodule FORCE_OUT source which can trigger force logic output update.
 */
typedef enum _pwm_sm_force_signal_select
{
    kPWM_LocalSoftwareForce = 0U, /*!< The local software force signal CTRL2[FORCE] is used to force updates. */
    kPWM_MasterSoftwareForce,     /*!< The master software force signal from submodule 0 is used to force updates. */
    kPWM_LocalReloadForce,        /*!< The local reload signal from this submodule is used to force updates without
                                      regard to the state of LDOK. */
    kPWM_MasterReloadForce,       /*!< The master reload signal from submodule 0 is used to force updates if LDOK is
                                             set, should not be used in submodule 0. */
    kPWM_LocalSyncForce,          /*!< The local sync (VAL1 match event) signal from this submodule is used to force
                                          updates. */
    kPWM_MasterSyncForce,         /*!< The master sync signal from submodule0 is used to force updates. */
    kPWM_ExternalForceForce, /*!< The external force signal EXT_FORCE, from outside the PWM module causes updates. */
    kPWM_ExternalSyncForce   /*!< The external sync signal EXT_SYNC, from outside the PWM module causes updates. */
} pwm_sm_force_signal_select_t;

/*!
 * @brief The enumeration for PWM submodule force out logic output (PWM23 and PWM45) source, which will transfer to
 *        output logic when a FORCE_OUT signal is asserted.
 */
typedef enum _pwm_sm_force_deadtime_source
{
    kPWM_GeneratedPwm = 0U,    /*!< Generated PWM signal is used as the deadtime logic output. */
    kPWM_InvertedGeneratedPwm, /*!< Inverted PWM signal is used as the deadtime logic output. */
    kPWM_SoftwareControlValue, /*!< Software controlled value is used as the deadtime logic output. */
    kPWM_UseExternal           /*!< PWM_EXTA signal is used as the deadtime logic output. */
} pwm_sm_force_deadtime_source_t;

/*!
 * @brief The enumeration for PWM submodule software controlled force out signal value.
 */
typedef enum _pwm_sm_force_software_output_value
{
    kPWM_SoftwareOutputLow = 0U, /*!< A logic 0 is supplied to the deadtime generator when chose Software
                                           controlled value as output source.*/
    kPWM_SoftwareOutputHigh,     /*!< A logic 1 is supplied to the deadtime generator when chose Software
                                           controlled value as output source.*/
} pwm_sm_force_software_output_value_t;

/*!
 * @brief The structure for configuring PWM submodule force logic.
 */
typedef struct _pwm_sm_force_logic_config
{
    uint8_t bitPWM23OutputInitialVaule : 1U; /*!< Configures PWM submodule compare output x (PwmX) initial value. */
    uint8_t bitPWM45OutputInitialVaule : 1U; /*!< Configures PWM submodule compare output A (PwmA) initial value. */
    uint8_t bitPWMXOutputInitialVaule : 1U;  /*!< Configures PWM submodule compare output B (PwmB) initial value. */
    pwm_sm_force_signal_select_t eForceSignalSelect : 3U; /*!< Configures PWM submodule force out select update trigger
                                                               source. */
    pwm_sm_force_software_output_value_t eSoftOutputFor23 : 1U; /*!< Configures PWM submodule force out PwmA value
                                                                        when select software as output source. */
    pwm_sm_force_software_output_value_t eSoftOutputFor45 : 1U; /*!< Configures PWM submodule force out PwmB value
                                                                        when select software as output source. */
    pwm_sm_force_deadtime_source_t eForceOutput23 : 2U;         /*!< Configures the source of Pwm23, which will be force
                                                                         to deadtime logic. */
    pwm_sm_force_deadtime_source_t eForceOutput45 : 2U;         /*!< Configures the source of Pwm45, which will be force
                                                                         to deadtime logic. */
} pwm_sm_force_logic_config_t;

/*!
 * @brief The enumeration for PWM submodule deadtime logic mode, which decide how the deadtime logic process the force
 *        logic output signal.
 */
typedef enum _pwm_sm_deadtime_logic_mode
{
    kPWM_Independent = 0U, /*!< The PWMA (PWM23) and PWMB (PWM45) signal from force logic transfer to output
                                      logic independent. */
    kPWM_IndependentWithDoubleSwitchPwm,      /*!< The PWMA (PWM23) and PWMB (PWM45) signals from force logic
                                                         will XOR first, then the XOR signal transfer to output logic
                                                         independent. */
    kPWM_IndependentWithSplitDoubleSwitchPwm, /*!< The PWMA (PWM23) and PWMB (PWM45) signals from force_out
                                                    logic will XOR first, then the XOR signal transfer to output logic
                                                    independent. */
    kPWM_ComplementaryWithPwmA,            /*!< The PWMA (PWM23) signal from force logic will transfer to output logic
                                                       with complementary mode. */
    kPWM_ComplementaryWithPwmB,            /*!< The PWMB (PWM45) signal from force logic will transfer to output logic
                                                       with complementary mode. */
    kPWM_ComplementaryWithDoubleSwitchPwm, /*!< The PWMA (PWM23) and PWMB (PWM45) signals from force logic
                                                    will XOR first, then the XOR signal transfer to output logic with
                                                    complementary mode. */
} pwm_sm_deadtime_logic_mode_t;

/*!
 * @brief The structure of the inserted dead time value, applies only to KPWM_Complementaryxxx mode.
 */
typedef struct _pwm_sm_deadtime_value
{
#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
    uint16_t bitsFractionalCycles : 5U; /*!< Specify the fractional cycle added to the number of integer deadtime
                                         cycles. In terms of 1/32 IPBus clock cycles, range is 0x0 ~ 0x1F. Only valid
                                         when the fractional delays feature is enabled (FRCNTRL[FRAC23_EN]
                                         is set when PWM23 is used to generate complementary PWM, or FRCNTRL[FRAC45_EN])
                                         is set when PWM45 is used to generate complementary PWM. */
#endif
    uint16_t bitsIntegerCycles : 11U; /*!< Specify the number of integer deadtime cycles. In terms of IPBus clock
                                          cycles, range is 0x0 ~ 0x7FF. */
} pwm_sm_deadtime_value_t;

/*!
 * @brief The structure for configuring PWM submodule force out logic, works on the deadtime logic output.
 */
typedef struct _pwm_sm_deadtime_logic_config
{
    pwm_sm_deadtime_logic_mode_t eMode; /*!< The mode in which Deadtime logic process the force logic output signal. */
    pwm_sm_deadtime_value_t sDeadTimeValue0; /*!< Control the deadtime during 0 to 1 transitions of the PWM_23 output
                            (assuming normal polarity). When disable fractional delays, the maximum value is 0x7FF which
                            represents 2047 cycles of IP bus cycles. When enable fractional delays, the maximum value is
                            0xFFFF which represents 2047 31/32 cycles cycles of IP bus cycles. */
    pwm_sm_deadtime_value_t sDeadTimeValue1; /*!< Control the deadtime during 0 to 1 transitions of the PWM_45 output
                             (assuming normal polarity). When disable fractional delays, the maximum value is 0x7FF
                             which represents 2047 cycles of IP bus cycles. When enable fractional delays, the maximum
                             value is 0xFFFF which represents 2047 31/32 cycles cycles of IP bus cycles. */
} pwm_sm_deadtime_logic_config_t;

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
/*!
 * @brief The enumeration for PWM submodule FRACVAL registers.
 */
typedef enum _pwm_sm_fracval_register
{
    kPWM_FRACVAL1 = 1U, /*!< PWM submodule fractional value register 1. */
    kPWM_FRACVAL2,      /*!< PWM submodule fractional value register 2. */
    kPWM_FRACVAL3,      /*!< PWM submodule fractional value register 3. */
    kPWM_FRACVAL4,      /*!< PWM submodule fractional value register 4. */
    kPWM_FRACVAL5,      /*!< PWM submodule fractional value register 5. */
} pwm_sm_fracval_register_t;

/*!
 * @brief The structure for configuring PWM submodule fractional delay logic, works on the deadtime logic output.
 */
typedef struct _pwm_sm_fractional_delay_logic_config
{
    uint8_t bitsFracValue1 : 5U; /*!< Configures PWM submodule compare register VAL1 fractional delay value, the unit
                                     is 1/32 IP bus clock. */
    bool bEnableVal1FractionalDelay; /*!< Enable the fractional delay feature of bitsFracValue1. */
    uint8_t bitsFracValue2 : 5U; /*!< Configures PWM submodule compare register VAL2 fractional delay value, the unit
                                     is 1/32 IP bus clock. */
    uint8_t bitsFracValue3 : 5U; /*!< Configures PWM submodule compare register VAL3 fractional delay value, the unit
                                     is 1/32 IP bus clock. */
    bool bEnableVal23FractionalDelay; /*!< Enable the fractional delay feature of bitsFracValue2 and bitsFracValue3. */
    uint8_t bitsFracValue4 : 5U; /*!< Configures PWM submodule compare register VAL4 fractional delay value, the unit
                                     is 1/32 IP bus clock. */
    uint8_t bitsFracValue5 : 5U; /*!< Configures PWM submodule compare register VAL5 fractional delay value, the unit
                                     is 1/32 IP bus clock. */
    bool bEnableVal45FractionalDelay; /*!< Enable the fractional delay feature of bitsFracValue4 and bitsFracValue5. */
} pwm_sm_fractional_delay_logic_config_t;

