nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
#endif
/*!
 * @brief The enumeration for PWM submodule output logic final trigger output port signal.
 */
typedef enum _pwm_sm_mux_trigger_source
{
    kPWM_ActualCompareEvent = 0U, /*!< Route the PWM_OUT_TRIG signal (OR of VALx compare signal) to the mux trigger
                                     output port. */
    kPWM_PwmOutput, /*!< Route the PWM output (after polarity/mask/enable control) to the mux trigger output port. */

} pwm_sm_mux_trigger_source_t;

/*!
 * @brief The enumeration for PWM submodule output logic PWM output fault status.
 */
typedef enum _pwm_sm_pwm_output_on_fault
{
    kPWM_OutputLowOnFault = 0U, /*!< The output is forced to logic 0 state prior to consideration of output
                            polarity/mask/enable control during fault conditions and STOP mode. */
    kPWM_OutputHighOnFault,     /*!< The output is forced to logic 1 state prior to consideration of output
                                 polarity/mask/enable control during fault conditions and STOP mode. */
    kPWM_OutputTristatedOnFault /*!< The output status be tristated during fault conditions and STOP mode. */
} pwm_sm_pwm_output_on_fault_t;

/*!
 * @brief The enumeration for PWM submodule output logic PwmX signal input source (before output polarity/mask/enable
 *        control).
 */
typedef enum _pwm_sm_pwmx_signal_select
{
    kPWM_RawPwmX = 0U, /*!< The PWM_X source is raw Pwm01_fractional_delay signal. */
    kPWM_DoubleSwitch, /*!< The PWM_X source is Pwm23_fractional_delay XOR Pwm23_fractional_delay signal. */
} pwm_sm_pwmx_signal_select_t;

/*!
 * @brief The enumeration for PWM submodule PWM output.
 */
typedef enum _pwm_sm_pwm_out
{
    kPWM_PwmX = 0U, /*!< The PWM output PWM_X. */
    kPWM_PwmA,      /*!< The PWM output PWM_A. */
    kPWM_PwmB       /*!< The PWM output PWM_B. */
} pwm_sm_pwm_out_t;

/*!
 * @brief The structure for configuring PWM submodule output logic.
 */
typedef struct _pwm_sm_output_logic_config_t
{
    bool bVal0TriggerEnable : 1U;       /*!< Enable VAL0 register compare event trigger. */
    bool bVal1TriggerEnable : 1U;       /*!< Enable VAL1 register compare event trigger. */
    bool bVal2TriggerEnable : 1U;       /*!< Enable VAL2 register compare event trigger. */
    bool bVal3TriggerEnable : 1U;       /*!< Enable VAL3 register compare event trigger. */
    bool bVal4TriggerEnable : 1U;       /*!< Enable VAL4 register compare event trigger. */
    bool bVal5TriggerEnable : 1U;       /*!< Enable VAL5 register compare event trigger. */
    bool bEnableTriggerPostScaler : 1U; /*!< True : Trigger outputs are generated only during the final PWM period prior
                                           to a reload opportunity, false : Trigger outputs are generated during every
                                           PWM period. */
#if (defined(FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL) && FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL)
    /*!< Configures PWM submodule mux trigger output signal 0 source. */
    pwm_sm_mux_trigger_source_t eMuxTrigger0 : 1U;
    /*!< Configures PWM submodule mux trigger output signal 1 source. */
    pwm_sm_mux_trigger_source_t eMuxTrigger1 : 1U;
#endif
    /*!< Configures PWM submodule PWM_X output source (before polarity/mask/enable control). */
    pwm_sm_pwmx_signal_select_t ePwmXSignalSelect : 1U;
    bool bInvertPwmxOutput : 1U; /*!< True : invert PWM_X output, false : no invert PWM_X output. */
    bool bInvertPwmaOutput : 1U; /*!< True : invert PWM_A output, false : no invert PWM_A output. */
    bool bInvertPwmbOutput : 1U; /*!< True : invert PWM_B output, false : no invert PWM_B output. */
    bool bMaskPwmxOutput : 1U;   /*!< True : PWM_X output masked, false : PWM_X output normal. Mask bit is buffered, and
                                    take effect until FORCE_OUT event or software update command. */
    bool bMaskPwmaOutput : 1U;   /*!< True : PWM_A output masked, false : PWM_A output normal. Mask bit is buffered, and
                                    take effect until FORCE_OUT event or software update command. */
    bool bMaskPwmbOutput : 1U;   /*!< True : PWM_B output masked, false : PWM_B output normal. Mask bit is buffered, and
                                    take effect until FORCE_OUT event or software update command. */
    bool bEnablePwmxOutput : 1U; /*!< True : Enable PWM_X output. false : PWM_X is disabled and output is tristated. */
    bool bEnablePwmaOutput : 1U; /*!< True : Enable PWM_A output. false : PWM_A is disabled and output is tristated. */
    bool bEnablePwmbOutput : 1U; /*!< True : Enable PWM_B output. false : PWM_B is disabled and output is tristated. */
    /*!< Configures PWM submodule PWM_X output during fault status (only works when fault status enable). */
    pwm_sm_pwm_output_on_fault_t ePwmxFaultState : 2U;
    /*!< Configures PWM submodule PWM_A output during fault status (only works when fault status enable). */
    pwm_sm_pwm_output_on_fault_t ePwmaFaultState : 2U;
    /*!< Configures PWM submodule PWM_B output during fault status (only works when fault status enable). */
    pwm_sm_pwm_output_on_fault_t ePwmbFaultState : 2U;
} pwm_sm_output_logic_config_t;

/*!
 * @brief The enumeration for PWM submodule input capture pins.
 */
typedef enum _pwm_sm_input_capture_pin
{
    kPWM_InputCapturePwmX = 0U, /*!< The input capture pin PwmX, need disable PwmX output when enable input capture. */
    kPWM_InputCapturePwmA,      /*!< The input capture pin PwmA, need disable PwmA output when enable input capture. */
    kPWM_InputCapturePwmB       /*!< The input capture pin PwmB, need disable PwmB output when enable input capture. */
} pwm_sm_input_capture_pin_t;

/*!
 * @brief The enumeration for PWM submodule input capture source.
 */
typedef enum _pwm_sm_input_capture_source
{
    kPWM_RawInput = 0U,    /*!< The capture source is the raw input signal. */
    kPWM_InputEdgeCounter, /*!< The capture source is edge counter which counts rising and falling edges on the raw
                              input signal. */

} pwm_sm_input_capture_source_t;

/*!
 * @brief The enumeration for PWM submodule input capture edge when choose raw input as capture source.
 */
typedef enum _pwm_sm_input_capture_edge
{
    kPWM_Noedge = 0U,    /*!< Disabled capture on source falling/falling edge. */
    kPWM_FallingEdge,    /*!< Enable input capture, and capture on source falling edge when chose the raw input
                              signal as capture source. */
    kPWM_RisingEdge,     /*!< Enable input capture, and capture on source rising edge when chose the raw input
                              signal as capture source. */
    kPWM_RiseAndFallEdge /*!<  Enable input capture, and capture on source rising or falling edge when chose
                            the raw input signal as capture source. */
} pwm_sm_input_capture_edge_t;

/*!
 * @brief The enumeration for PWM submodule input capture value register.
 */
typedef enum _pwm_sm_input_capture_register
{
    kPWM_InpCaptureVal0 = 0U, /*!< Stores the value captured from the submodule counter when the PWM_X circuitry 0
                            logic capture occurs.*/
    kPWM_InpCaptureVal1 = 2U, /*!< Stores the value captured from the submodule counter when the PWM_X circuitry 1
                            logic capture occurs. */
    kPWM_InpCaptureVal2 = 4U, /*!< Stores the value captured from the submodule counter when the PWM_A circuitry 0
                            logic capture occurs. */
    kPWM_InpCaptureVal3 = 6U, /*!< Stores the value captured from the submodule counter when the PWM_A circuitry 1
                           logic capture occurs. */
    kPWM_InpCaptureVal4 = 8U, /*!< Stores the value captured from the submodule counter when the PWM_B circuitry 0
                           logic capture occurs. */
    kPWM_InpCaptureVal5 = 10U /*!< Stores the value captured from the submodule counter when the PWM_B circuitry 1
                           logic capture occurs. */
} pwm_sm_input_capture_register_t;

/*!
 * @brief The structure for configuring PWM submodule input capture logic.
 *
 * @note When choosing kPWM_InputEdgeCounter as circuit 0/1 capture source, the eCircuit0CaptureEdge and
 *       eCircuit1CaptureEdge selected trigger edge will be ignored, but still need place a value other than
 *       kPWM_Noedge in either or both of the eCaptureCircuit0 and/or CaptureCircuit1 fields in order to
 *       enable one or both of the capture registers.
 */
typedef struct _pwm_sm_input_capture_config
{
    bool bEnableInputCapture : 1U; /*!< True: enable the input capture process, false : disable the input capture
                                      process. */
    pwm_sm_input_capture_source_t eInCaptureSource : 1U;   /*!< Configures capture circuit 0/1 input source */
    pwm_sm_input_capture_edge_t eCircuit0CaptureEdge : 2U; /*!< Configures which edge causes a capture for capture
                                  circuit 0 , will be ignore when use edge counter as capture source. */
    pwm_sm_input_capture_edge_t eCircuit1CaptureEdge : 2U; /*!< Configures which edge causes a capture for capture
                                  circuit 1 , will be ignore when use edge counter as capture source. */
    bool bEnableOneShotCapture : 1U; /*!< True: Enable one-shot capture mode, the bEnableInputCapture will self-cleared
                                   when one or more of the enabled capture circuits has had a capture event;
                                   false: Capture circuit 0/1 will perform capture continue; */
    uint8_t bitsCaptureFifoWatermark : 2U; /*!< Watermark level for circuit 0/1 capture FIFO. The capture flags in
                                the status register will set if the word count in the circuit 0/1 capture FIFO
                                is greater than this watermark level */
    uint8_t u8EdgeCounterCompareValue;     /*!< Edge counter compare value, used only if edge counter is used as capture
                                              circuit 0/1 input source */
} pwm_sm_input_capture_config_t;

/*!
 * @brief The enumeration for the source which can trigger the DMA read requests for the capture FIFOs.
 *   .
 */
typedef enum _pwm_sm_capture_dma_source
{
    kPWM_FIFOWatermarksORDma  = 0x1U, /*!< Selected FIFO watermarks are OR'ed together to sets the read DMA request. */
    kPWM_FIFOWatermarksANDDma = 0x5U, /*!< Selected FIFO watermarks are AND'ed together to sets the read DMA request. */
    kPWM_LocalSyncDma         = 0x2u, /*!< A local sync (VAL1 match event) sets the read DMA request. */
    kPWM_LocalReloadDma       = 0x3U  /*!< A local reload (STS[RF] being set) sets the read DMA request. */
} pwm_sm_capture_dma_source_t;

/*!
 * @brief The structure for configuring PWM submodule read capture DMA.
 */
typedef struct _pwm_sm_capture_dma_config
{
    bool bEnableCaptureDMA : 1U;                        /*!< Enables DMA read requests for the Capture FIFOs. */
    pwm_sm_capture_dma_source_t eCaptureDMASource : 3U; /*!< Select the source to enables DMA read requests for the
                                                    Capture FIFOs. Will be ignored when bEnableCaptureDMA be false. */
} pwm_sm_capture_dma_config_t;

/*!
 * @brief The structure for configuring PWM submodule DMA.
 */
typedef struct _pwm_sm_dma_config
{
    bool bEnableWriteValDMA : 1U;      /*!< STS[RF] set enables DMA write requests for VALx and FRACVALx registers. */
    bool bEnableReadCaptureX0DMA : 1U; /*!< STS[CFX0] set enables DMA read requests for Capture X0 FIFO. And X0 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    bool bEnableReadCaptureX1DMA : 1U; /*!< STS[CFX1] set enables DMA read requests for Capture X1 FIFO. And X1 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    bool bEnableReadCaptureA0DMA : 1U; /*!< STS[CFA0] set enables DMA read requests for Capture A0 FIFO. And A0 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    bool bEnableReadCaptureA1DMA : 1U; /*!< STS[CFA1] set enables DMA read requests for Capture A1 FIFO. And A1 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    bool bEnableReadCaptureB0DMA : 1U; /*!< STS[CFB0] set enables DMA read requests for Capture B0 FIFO. And B0 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    bool bEnableReadCaptureB1DMA : 1U; /*!< STS[CFB1] set enables DMA read requests for Capture B1 FIFO. And B1 FIFO
                                          watermark is selected for sCaptureDma @ref pwm_sm_capture_dma_config_t. */
    pwm_sm_capture_dma_config_t sCaptureDma; /*!< DMA read requests for the capture FIFOs configure. */
} pwm_sm_dma_config_t;

/*!
 * @brief The enumeration for PWM submodule output fault enable mask for one fault protection channel.
 * @note The channel 0 input 0 and channel 1 input 0 are different pins.
 */
/*!
 * @brief The structure for configuring PWM submodule fault input disable mapping.
 * @note Each PWM output can be mapping anyone or more fault inputs. The mapped fault protection channel inputs can
 *       disable PWM output.
 */
typedef struct _pwm_sm_fault_input_mapping
{
    bool bFaultInput0Mapping : 1U; /*!< Mapping fault input 0 (from fault protection channel 0) to PWM output. */
    bool bFaultInput1Mapping : 1U; /*!< Mapping fault input 1 (from fault protection channel 0) to PWM output. */
    bool bFaultInput2Mapping : 1U; /*!< Mapping fault input 2 (from fault protection channel 0) to PWM output. */
    bool bFaultInput3Mapping : 1U; /*!< Mapping fault input 3 (from fault protection channel 0) to PWM output. */
    bool bFaultInput4Mapping : 1U; /*!< Mapping fault input 4 (from fault protection channel 1) to PWM output. */
    bool bFaultInput5Mapping : 1U; /*!< Mapping fault input 5 (from fault protection channel 1) to PWM output. */
    bool bFaultInput6Mapping : 1U; /*!< Mapping fault input 6 (from fault protection channel 1) to PWM output. */
    bool bFaultInput7Mapping : 1U; /*!< Mapping fault input 7 (from fault protection channel 1) to PWM output. */
} pwm_sm_fault_input_mapping_t;

/*!
 * @brief The enumeration for PWM submodule interrupt enable.
 */
enum _pwm_sm_interrupt_enable
{
    kPWM_CompareVal0InterruptEnable = (1U << 0),  /*!< PWM submodule VAL0 compare interrupt. */
    kPWM_CompareVal1InterruptEnable = (1U << 1),  /*!< PWM submodule VAL1 compare interrupt. */
    kPWM_CompareVal2InterruptEnable = (1U << 2),  /*!< PWM submodule VAL2 compare interrupt. */
    kPWM_CompareVal3InterruptEnable = (1U << 3),  /*!< PWM submodule VAL3 compare interrupt. */
    kPWM_CompareVal4InterruptEnable = (1U << 4),  /*!< PWM submodule VAL4 compare interrupt. */
    kPWM_CompareVal5InterruptEnable = (1U << 5),  /*!< PWM submodule VAL5 compare interrupt. */
    kPWM_CaptureX0InterruptEnable   = (1U << 6),  /*!< PWM submodule capture X0 interrupt. */
    kPWM_CaptureX1InterruptEnable   = (1U << 7),  /*!< PWM submodule capture X1 interrupt. */
    kPWM_CaptureB0InterruptEnable   = (1U << 8),  /*!< PWM submodule capture B0 interrupt. */
    kPWM_CaptureB1InterruptEnable   = (1U << 9),  /*!< PWM submodule capture B1 interrupt. */
    kPWM_CaptureA0InterruptEnable   = (1U << 10), /*!< PWM submodule capture A0 interrupt. */
    kPWM_CaptureA1InterruptEnable   = (1U << 11), /*!< PWM submodule capture A1 interrupt. */
    kPWM_ReloadInterruptEnable      = (1U << 12), /*!< PWM submodule reload interrupt. */
    kPWM_ReloadErrorInterruptEnable = (1U << 13), /*!< PWM submodule reload error interrupt. */
    kPWM_ALLSubModuleInterruptEnable =
        (kPWM_CompareVal0InterruptEnable | kPWM_CompareVal1InterruptEnable | kPWM_CompareVal2InterruptEnable |
         kPWM_CompareVal3InterruptEnable | kPWM_CompareVal4InterruptEnable | kPWM_CompareVal5InterruptEnable |
         kPWM_CaptureX0InterruptEnable | kPWM_CaptureX1InterruptEnable | kPWM_CaptureB0InterruptEnable |
         kPWM_CaptureB1InterruptEnable | kPWM_CaptureA0InterruptEnable | kPWM_CaptureA1InterruptEnable |
         kPWM_ReloadInterruptEnable | kPWM_ReloadErrorInterruptEnable)
};

/*!
 * @brief The enumeration for PWM submodule status flags.
 */
typedef enum _pwm_sm_status_flags
{
    kPWM_CompareVal0Flag  = (1U << 0),  /*!< PWM submodule VAL0 compare flag. */
    kPWM_CompareVal1Flag  = (1U << 1),  /*!< PWM submodule VAL1 compare flag. */
    kPWM_CompareVal2Flag  = (1U << 2),  /*!< PWM submodule VAL2 compare flag. */
    kPWM_CompareVal3Flag  = (1U << 3),  /*!< PWM submodule VAL3 compare flag. */
    kPWM_CompareVal4Flag  = (1U << 4),  /*!< PWM submodule VAL4 compare flag. */
    kPWM_CompareVal5Flag  = (1U << 5),  /*!< PWM submodule VAL5 compare flag. */
    kPWM_CaptureX0Flag    = (1U << 6),  /*!< PWM submodule capture X0 flag. */
    kPWM_CaptureX1Flag    = (1U << 7),  /*!< PWM submodule capture X1 flag. */
    kPWM_CaptureB0Flag    = (1U << 8),  /*!< PWM submodule capture B0 flag. */
    kPWM_CaptureB1Flag    = (1U << 9),  /*!< PWM submodule capture B1 flag. */
    kPWM_CaptureA0Flag    = (1U << 10), /*!< PWM submodule capture A0 flag. */
    kPWM_CaptureA1Flag    = (1U << 11), /*!< PWM submodule capture A1 flag. */
    kPWM_ReloadFlag       = (1U << 12), /*!< PWM submodule reload flag. */
    kPWM_ReloadErrorFlag  = (1U << 13), /*!< PWM submodule reload error flag. */
    kPWM_RegUpdatedFlag   = (1U << 14), /*!< PWM submodule registers updated flag. */
    kPWM_ALLSMStatusFlags = (kPWM_CompareVal0Flag | kPWM_CompareVal1Flag | kPWM_CompareVal2Flag | kPWM_CompareVal3Flag |
                             kPWM_CompareVal4Flag | kPWM_CompareVal5Flag | kPWM_CaptureX0Flag | kPWM_CaptureX1Flag |
                             kPWM_CaptureB0Flag | kPWM_CaptureB1Flag | kPWM_CaptureA0Flag | kPWM_CaptureA1Flag |
                             kPWM_ReloadFlag | kPWM_ReloadErrorFlag | kPWM_RegUpdatedFlag)
} pwm_sm_status_flags_t;

/*!
 * @brief The enumeration for some PWM submodule PWM_A/B typical output mode.
 */
typedef enum _pwm_sm_typical_output_mode
{
    kPWM_SignedCenterAligned = 0U, /*!< Center-aligned PWM with signed compare value. */
    kPWM_CenterAligned,            /*!< Center-aligned PWM with unsigned compare value. */
    kPWM_SignedEdgeAligned,        /*!< Edge-aligned PWM with signed compare value. */
    kPWM_EdgeAligned               /*!< Edge-aligned PWM with signed compare value. */
} pwm_sm_typical_output_mode_t;

/*!
 * @brief PWM submodule config structure
 *
 * This structure holds the configuration settings for the PWM peripheral. To initialize this
 * structure to reasonable defaults, call the PWM_GetDefaultConfig() function and pass a
 * pointer to your config structure instance.
 *
 */
typedef struct _pwm_sm_config
{
    bool enableDebugMode : 1U; /*!< true: PWM continues to run in debug mode; false: PWM is paused in debug mode. */
    bool enableWaitMode : 1U;  /*!< true: PWM continues to run in WAIT mode; false: PWM is paused in WAIT mode. */
    bool enableRun : 1U;       /*!< true: PWM submodule is enabled;  false: PWM submodule is disabled. */
    /*!< Configures submodule value registers compare mode, only can be written one time. */
    pwm_sm_val_compare_mode_t eValCompareMode : 1U;
    pwm_sm_counter_config_t sCounterConfig;            /*!< Submodule counter logic config. */
    pwm_sm_reload_logic_config_t sReloadConfig;        /*!< Submodule reload control logic config. */
    pwm_sm_value_register_config_t sValRegisterConfig; /*!< Submodule value registers config. */
    pwm_sm_force_logic_config_t sForceConfig;          /*!< Submodule force out logic config. */
    pwm_sm_deadtime_logic_config_t sDeadTimeConfig;    /*!< Submodule deadtime logic config. */
#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
    pwm_sm_fractional_delay_logic_config_t sFracDelayConfig; /*!< Submodule fractional logic config. */
#endif
    pwm_sm_output_logic_config_t sOutputConfig;        /*!< Submodule output logic config. */
    pwm_sm_input_capture_config_t sInCaptureConfig[3]; /*!< Submodule input capture config for PWM_X/A/B pins. */
    pwm_sm_dma_config_t sDMAConfig;                    /*!< Submodule DMA config. */
    /*!< PWM_X output fault input mapping, determines which fault inputs can disable PWM_X output. */
    pwm_sm_fault_input_mapping_t sPwmXFaultInputMapping;
    /*!< PWM_A output fault input mapping, determines which fault inputs can disable PWM_A output. */
    pwm_sm_fault_input_mapping_t sPwmAFaultInputMapping;
    /*!< PWM_B output fault input mapping, determines which fault inputs can disable PWM_B output. */
    pwm_sm_fault_input_mapping_t sPwmBFaultInputMapping;
    /*!< Submodule interrupt enable mask, logic OR of @ref _pwm_sm_interrupt_enable. */
    uint16_t u16EnableInterruptMask;
} pwm_sm_config_t;

/*!
 * @brief The enumeration for PWM fault protection channel number.
 */
typedef enum _pwm_fault_protection_channel
{
    kPWM_FaultProtection0 = 0U, /*!< PWM fault protection channel 0 */
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    kPWM_FaultProtection1 /*!< PWM fault protection channel 1 */
#endif
} pwm_fault_protection_channel_t;

/*!
 * @brief The enumeration for PWM module fault protection channel interrupt enable.
 */
enum _pwm_fault_protection_interrupt_enable
{
    kPWM_Fault0InterruptEnable   = (1U << 0U), /*!< Fault protection channel fault 0 interrupt */
    kPWM_Fault1InterruptEnable   = (1U << 1U), /*!< Fault protection channel fault 1 interrupt */
    kPWM_Fault2InterruptEnable   = (1U << 2U), /*!< Fault protection channel fault 2 interrupt */
    kPWM_Fault3InterruptEnable   = (1U << 3U), /*!< Fault protection channel fault 3 interrupt */
    kPWM_ALLfaultInterruptEnable = (kPWM_Fault0InterruptEnable | kPWM_Fault1InterruptEnable |
                                    kPWM_Fault2InterruptEnable | kPWM_Fault3InterruptEnable)
};

/*!
 * @brief The enumeration for PWM module fault protection status flags
 */
enum _pwm_fault_protection_status_flags
{
    kPWM_Fault0Flag = (1U << 0U),          /*!< Fault protection channel fault 0 flag, set within two CPU cycles after a
                                              transition to active on the fault input pin 0. */
    kPWM_Fault1Flag = (1U << 1U),          /*!< Fault protection channel fault 1 flag, set within two CPU cycles after a
                                              transition to active on the fault input pin 1. */
    kPWM_Fault2Flag = (1U << 2U),          /*!< Fault protection channel fault 2 flag, set within two CPU cycles after a
                                              transition to active on the fault input pin 2. */
    kPWM_Fault3Flag = (1U << 3U),          /*!< Fault protection channel fault 3 flag, set within two CPU cycles after a
                                              transition to active on the fault input pin 3. */
    kPWM_FaultPin0ActiveFlag = (1U << 8U), /*!< Fault protection channel fault input pin 0 active flag. */
    kPWM_FaultPin1ActiveFlag = (1U << 9U), /*!< Fault protection channel fault input pin 1 active flag. */
    kPWM_FaultPin2ActiveFlag = (1U << 10U), /*!< Fault protection channel fault input pin 2 active flag. */
    kPWM_FaultPin3ActiveFlag = (1U << 11U), /*!< Fault protection channel fault input pin 3 active flag. */
    kPWM_ALLFaultStatusFlags =
        (kPWM_Fault0Flag | kPWM_Fault1Flag | kPWM_Fault2Flag | kPWM_Fault3Flag | kPWM_FaultPin0ActiveFlag |
         kPWM_FaultPin1ActiveFlag | kPWM_FaultPin2ActiveFlag | kPWM_FaultPin3ActiveFlag)
};

