nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
/*!
 * @brief The enumeration for PWM fault protection channel number.
 */
typedef enum _pwm_fault_active_level
{
    kPWM_Logic0 = 0U, /*!< A logic 0 on the fault input indicates a fault condition. */
    kPWM_Logic1       /*!< A logic 0 on the fault input indicates a fault condition. */
} pwm_fault_input_active_level_t;

typedef struct _pwm_fault_protection_input_config
{
    pwm_fault_input_active_level_t eFaultActiveLevel : 1U; /*!< Select the active logic level of the fault input. */
    bool bEnableAutoFaultClear : 1U; /*!< True : Enable automatic fault clearing, fault recovery (PWM outputs can
                                        re-enable) occurs when FSTS[FFPINx] is clear , false : Use manual fault
                                        clearing, fault recovery (PWM outputs can re-enable) occurs when FSTS[FFLAGx] is
                                        manual clear (and FSTS[FFPINx] is clear). */
    bool bEnableManualFaultClearSafeMode : 1U; /*!< True : fault recovery (PWM outputs can re-enable) occurs when
                                        FSTS[FFLAGx] is manual clear and FSTS[FFPINx] is clear, false : fault recovery
                                        (PWM outputs can re-enable) occurs when FSTS[FFLAGx] is manual clear. */
    bool bEnableFaultFullCycleRecovery : 1U;   /*!< Enable full cycle fault recovery, which make PWM outputs are
                                                  re-enabled at the start of a half cycle after fault recovery occurs. */
    bool bEnableFaultHalfCycleRecovery : 1U;   /*!< Enable half cycle fault recovery, which make PWM outputs are
                                                  re-enabled at the start of a half cycle after fault recovery occurs. */
    bool bEnableFaultNoCombinationalPath : 1U; /*!< True : The fault inputs are combined with the filtered and latched
                                                  fault signals to disable the PWM outputs , false : the filtered and
                                                  latched fault signals are used to disable the PWM outputs. */
    bool bEnableFaultInterrupt : 1U;           /*!< Enable the fault input interrupt. */
} pwm_fault_protection_input_config_t;

/*!
 * @brief The structure for configuring PWM fault protection channel, a PWM module can have multiple fault
 *        protection channels, PWM sub-module can choose to mapping any one or more fault input from fault protection
 * channels.
 */
typedef struct _pwm_fault_protection_config
{
    pwm_fault_protection_input_config_t sFaultInput[4];
    bool bEnableFaultGlitchStretch : 1U; /*!< Fault Glitch Stretch Enable: A logic 1 means that input
                                         fault signals will be stretched to at least 2 IPBus clock cycles. */
    uint8_t bitsFaultFilterCount : 3U;   /*!< Configures PWM fault protection channel fault filter count. */
    uint8_t u8FaultFilterPeriod; /*!< Configures PWM fault protection channel fault filter period, value of 0 will
                                    bypass the filter. */
} pwm_fault_protection_config_t;

/*!
 * @brief PWM module config structure which contain submodule config structure pointers and fault protection
 *        filter config structure pointers.
 *
 * @note Need use submodule structure address to init the structure pointers, when the submodule or fault protection
 * structure pointers is NULL, it will be ignored by PWM_Init API. This can save stack space when only one or two
 * submodules are used.
 *
 */
typedef struct _pwm_config
{
    /*!< PWM submodule config. */
    pwm_sm_config_t *psPwmSubmoduleConfig[FSL_FEATURE_PWM_SUBMODULE_COUNT];
    /*!< PWM fault protection channel config, will take effect for all submodules. */
    pwm_fault_protection_config_t *psFaultProtectionConfig[FSL_FEATURE_PWM_FAULT_CH_COUNT];
} pwm_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization And De-initialization Interfaces
 * @{
 */

/*!
 * @brief Initialization PWM module with provided structure @ref pwm_config_t.
 *
 * This function can initial one or more submodules of the PWM module.
 *
 * This examples shows how only initial submodule 0 without fault protection channel.
 * @code
 *     pwm_config_t sPwmConfig = {0};
 *     pwm_sm_config_t sPwmSm0Config;
 *     sPwmConfig.psPwmSubmoduleConfig[0] = &sPwmSm0Config;
 *     PWM_GetSmDefaultConfig(&sPwmSm0Config);
 *     PWM_Init(PWM, sPwmConfig);
 * @endcode
 *
 * @note This API should be called at the beginning of the application using the PWM driver.
 *
 * @param base        PWM peripheral base address.
 * @param eSubModule  PWM submodule number. See @ref pwm_sm_number_t.
 * @param psConfig    Pointer to PWM module configure structure. See @ref pwm_config_t.
 */
void PWM_Init(PWM_Type *base, const pwm_config_t *psConfig);

/*!
 * @brief De-initialization a PWM module.
 *
 * @param base   PWM peripheral base address
 */
void PWM_Deinit(PWM_Type *base);

/*!
 * @brief Gets an default PWM submodule's configuration.
 *
 * This function fills in the initialization structure member, which can make submodule generate 50% duty cycle center
 * aligned PWM_A/B output.
 *
 * The default effective values are:
 * @code
 *   psConfig->enableDebugMode = false;
 *   psConfig->enableWaitMode = false;
 *   psConfig->enableRun = false;
 *   psConfig->sCounterConfig.eCountClockSource = kPWM_ClockSrcBusClock;
 *   psConfig->sCounterConfig.eCountClockPrescale = kPWM_ClockPrescaleDivide1;
 *   psConfig->sCounterConfig.eCountInitSource = kPWM_InitOnLocalSync;
 *   psConfig->sReloadConfig.eReloadSignalSelect = kPWM_LocalReloadSignal;
 *   psConfig->sReloadConfig.eLoclReloadEffectTime = kPWM_TakeEffectAtReloadOportunity;
 *   psConfig->sReloadConfig.eLocalReloadOportunity = kPWM_LoadEveryOportunity;
 *   psConfig->sReloadConfig.bEnableFullCycleReloadOportunity = true;
 *   psConfig->sReloadConfig.bEnableHalfCycleReloadOportunity = false;
 *   psConfig->sValRegisterConfig.u16CounterInitialValue = 0xFF00U;
 *   psConfig->sValRegisterConfig.u16ValRegister0 = 0x0U;
 *   psConfig->sValRegisterConfig.u16ValRegister1 = 0x00FFU;
 *   psConfig->sValRegisterConfig.u16ValRegister2 = 0xFF80U;
 *   psConfig->sValRegisterConfig.u16ValRegister3 = 0x80U;
 *   psConfig->sValRegisterConfig.u16ValRegister4 = 0xFF80U;
 *   psConfig->sValRegisterConfig.u16ValRegister5 = 0x80U;
 *   psConfig->sForceConfig.eForceSignalSelect = kPWM_LocalSoftwareForce;
 *   psConfig->sForceConfig.eSoftOutputFor23 = kPWM_SoftwareOutputLow;
 *   psConfig->sForceConfig.eSoftOutputFor45 = kPWM_SoftwareOutputLow;
 *   psConfig->sForceConfig.eForceOutput23 = kPWM_GeneratedPwm;
 *   psConfig->sForceConfig.eForceOutput45 = kPWM_GeneratedPwm;
 *   psConfig->sDeadTimeConfig.eMode = kPWM_Independent;
 *   psConfig->sOutputConfig.ePwmXSignalSelect = kPWM_RawPwmX;
 *   psConfig->sOutputConfig.bEnablePwmxOutput = true;
 *   psConfig->sOutputConfig.bEnablePwmaOutput = true;
 *   psConfig->sOutputConfig.bEnablePwmbOutput = true;
 *   psConfig->sOutputConfig.ePwmxFaultState = kPWM_OutputLowOnFault;
 *   psConfig->sOutputConfig.ePwmaFaultState = kPWM_OutputLowOnFault;
 *   psConfig->sOutputConfig.ePwmbFaultState = kPWM_OutputLowOnFault;
 * @endcode
 * @param psConfig  Pointer to user's PWM submodule config structure. See @ref pwm_sm_config_t.
 */
void PWM_GetSMDefaultConfig(pwm_sm_config_t *psConfig);

/*!
 * @brief Gets an default fault protection channel's configuration.
 *
 * The default effective values are:
 * @code
 *   psConfig->sFaultInput[i].eFaultActiveLevel = kPWM_Logic0;
 *   psConfig->sFaultInput[i].bEnableAutoFaultClear = true;
 *   psConfig->sFaultInput[i].bEnableFaultFullCycleRecovery = true;
 * @endcode
 * @param psConfig  Pointer to user's PWM fault protection config structure. See @ref pwm_fault_protection_config_t.
 */

void PWM_GetFaultProtectionDefaultConfig(pwm_fault_protection_config_t *psConfig);

/*! @}*/

/*!
 * @name Submodule PWM Generation Related Interfaces
 * @{
 */

/*!
 * @brief Sets up the PWM submodule configure.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig     Pointer to submodule configure structure, see @ref pwm_sm_config_t.
 */
void PWM_SetupSMConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_config_t *psConfig);

/*!
 * @brief Sets up the PWM submodule counter configure.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig     Pointer to submodule counter configure structure, see @ref pwm_sm_counter_config_t.
 */
static inline void PWM_SetupCounterConfig(PWM_Type *base,
                                          pwm_sm_number_t eSubModule,
                                          const pwm_sm_counter_config_t *psConfig)
{
    base->SM[eSubModule].CTRL2 =
        (base->SM[eSubModule].CTRL2 & ~(uint16_t)(PWM_CTRL2_CLK_SEL_MASK | PWM_CTRL2_INIT_SEL_MASK)) |
        PWM_CTRL2_CLK_SEL(psConfig->eCountClockSource) | PWM_CTRL2_INIT_SEL(psConfig->eCountInitSource);
    base->SM[eSubModule].CTRL =
        (base->SM[eSubModule].CTRL & ~(uint16_t)(PWM_CTRL_PRSC_MASK)) | PWM_CTRL_PRSC(psConfig->eCountClockPrescaler);
    /* PHASEDLY register only exist in submodule 1 ~ 3 */
    if (eSubModule != kPWM_SubModule0)
    {
        base->SM[eSubModule].PHASEDLY = psConfig->u16PhaseDelayValue;
    }
}

/*!
 * @brief Sets the PWM submodule counter initial register value.
 *
 * This function set the INIT register value, the counter will start counting from INIT register value when initial
 * signal assert or software force set. This write value will be loaded into inner set of buffered registers
 * according to reload logic configure.
 *
 * @param base             PWM peripheral base address
 * @param eSubModule       PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16InitialValue  The submodule number counter initialize value.
 */
static inline void PWM_SetCounterInitialValue(PWM_Type *base, pwm_sm_number_t eSubModule, uint16_t u16InitialValue)
{
    base->SM[eSubModule].INIT = u16InitialValue;
}

/*!
 * @brief Sets up the PWM submodule reload logic configure.
 *
 * @param base         PWM peripheral base address.
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig     Pointer to submodule reload logic configure structure, see @ref pwm_sm_reload_control_config_t.
 */
static inline void PWM_SetupReloadLogicConfig(PWM_Type *base,
                                              pwm_sm_number_t eSubModule,
                                              const pwm_sm_reload_logic_config_t *psConfig)
{
    base->SM[eSubModule].CTRL2 = (base->SM[eSubModule].CTRL2 & ~(uint16_t)(PWM_CTRL2_RELOAD_SEL_MASK)) |
                                 PWM_CTRL2_RELOAD_SEL(psConfig->eReloadSignalSelect);

