nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
    base->SM[eSubModule].CTRL =
        (base->SM[eSubModule].CTRL &
         ~(uint16_t)(PWM_CTRL_LDFQ_MASK | PWM_CTRL_HALF_MASK | PWM_CTRL_FULL_MASK | PWM_CTRL_LDMOD_MASK)) |
        PWM_CTRL_LDFQ(psConfig->eLocalReloadOportunity) | PWM_CTRL_HALF(psConfig->bEnableHalfCycleReloadOportunity) |
        PWM_CTRL_FULL(psConfig->bEnableFullCycleReloadOportunity) | PWM_CTRL_LDMOD(psConfig->eLoclReloadEffectTime);
}

/*!
 * @brief Update PWM submodule compare value configuration according to the typical output mode.
 *
 * @param psConfig             See @ref pwm_sm_config_t.
 * @param eTypicalOutputMode   Typical PWM_A/B output mode. See @ref wm_sm_typical_output_mode_t.
 * @param u16PwmPeriod         PWM output period value in counter ticks. This value can be
 *                            got by (main counter clock in Hz) / (wanted PWM signal frequency in Hz).
 * @param u16PwmAPulseWidth    PWM_A pulse width value in counter ticks. Can got by (wanted PWM duty Cycle) *
 *                            u16PwmPeriod.
 * @param u16PwmBPulseWidth    PWM_B pulse width value in counter ticks. Can got by (wanted PWM duty Cycle) *
 *                            u16PwmPeriod.
 */
void PWM_GetValueConfig(pwm_sm_value_register_config_t *psConfig,
                        pwm_sm_typical_output_mode_t eTypicalOutputMode,
                        uint16_t u16PwmPeriod,
                        uint16_t u16PwmAPulseWidth,
                        uint16_t u16PwmBPulseWidth);

/*!
 * @brief Sets up the PWM submodule VALn registers logic configure.
 *
 * @param base         PWM peripheral base address.
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig     Pointer to VALn registers configure structure, see @ref pwm_sm_output_compare_config_t.
 */
static inline void PWM_SetupValRegisterConfig(PWM_Type *base,
                                              pwm_sm_number_t eSubModule,
                                              const pwm_sm_value_register_config_t *psConfig)
{
    base->SM[eSubModule].INIT = psConfig->u16CounterInitialValue;
    base->SM[eSubModule].VAL0 = psConfig->u16ValRegister0;
    base->SM[eSubModule].VAL1 = psConfig->u16ValRegister1;
    base->SM[eSubModule].VAL2 = psConfig->u16ValRegister2;
    base->SM[eSubModule].VAL3 = psConfig->u16ValRegister3;
    base->SM[eSubModule].VAL4 = psConfig->u16ValRegister4;
    base->SM[eSubModule].VAL5 = psConfig->u16ValRegister5;
}

/*!
 * @brief Sets the PWM submodule VALn register value.
 *
 * @note  These write value will be loaded into inner set of buffered registers according to reload logic configure.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister        Value register index (range in 0~5), see @ref pwm_sm_val_register_t.
 * @param u16Value         The value for VALn register.
 */
static inline void PWM_SetValueRegister(PWM_Type *base,
                                        pwm_sm_number_t eSubModule,
                                        pwm_sm_val_register_t eRegister,
                                        uint16_t u16Value)
{
    switch (eRegister)
    {
        case kPWM_VAL0:
            base->SM[eSubModule].VAL0 = u16Value;
            break;
        case kPWM_VAL1:
            base->SM[eSubModule].VAL1 = u16Value;
            break;
        case kPWM_VAL2:
            base->SM[eSubModule].VAL2 = u16Value;
            break;
        case kPWM_VAL3:
            base->SM[eSubModule].VAL3 = u16Value;
            break;
        case kPWM_VAL4:
            base->SM[eSubModule].VAL4 = u16Value;
            break;
        case kPWM_VAL5:
            base->SM[eSubModule].VAL5 = u16Value;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
}

/*!
 * @brief Gets the PWM submodule VALn register value.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister        Value register index (range in 0~5), see @ref pwm_sm_val_register_t.
 *
 * @return The VALn register value.
 */
static inline uint16_t PWM_GetValueRegister(PWM_Type *base, pwm_sm_number_t eSubModule, pwm_sm_val_register_t eRegister)
{
    uint16_t u16Regs = 0U;

    switch (eRegister)
    {
        case kPWM_VAL0:
            u16Regs = base->SM[eSubModule].VAL0;
            break;
        case kPWM_VAL1:
            u16Regs = base->SM[eSubModule].VAL1;
            break;
        case kPWM_VAL2:
            u16Regs = base->SM[eSubModule].VAL2;
            break;
        case kPWM_VAL3:
            u16Regs = base->SM[eSubModule].VAL3;
            break;
        case kPWM_VAL4:
            u16Regs = base->SM[eSubModule].VAL4;
            break;
        case kPWM_VAL5:
            u16Regs = base->SM[eSubModule].VAL5;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }

    return u16Regs;
}

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && (FSL_FEATURE_PWM_HAS_FRACTIONAL > 0U))

/*!
 * @brief Sets the PWM submodule fractional value register value.
 *
 * @note  These write value will be loaded into inner set of buffered registers according to reload logic configure.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister        Fractional value register index (range in 1~5), see @ref pwm_sm_val_register_t.
 * @param u16Value         The value for FRACVALn register.
 */
static inline void PWM_SetFracvalRegister(PWM_Type *base,
                                          pwm_sm_number_t eSubModule,
                                          pwm_sm_fracval_register_t eRegister,
                                          uint16_t u16Value)
{
    switch (eRegister)
    {
        case kPWM_FRACVAL1:
            base->SM[eSubModule].FRACVAL1 = PWM_FRACVAL1_FRACVAL1(u16Value);
            break;
        case kPWM_FRACVAL2:
            base->SM[eSubModule].FRACVAL2 = PWM_FRACVAL2_FRACVAL2(u16Value);
            break;
        case kPWM_FRACVAL3:
            base->SM[eSubModule].FRACVAL3 = PWM_FRACVAL3_FRACVAL3(u16Value);
            break;
        case kPWM_FRACVAL4:
            base->SM[eSubModule].FRACVAL4 = PWM_FRACVAL4_FRACVAL4(u16Value);
            break;
        case kPWM_FRACVAL5:
            base->SM[eSubModule].FRACVAL5 = PWM_FRACVAL5_FRACVAL5(u16Value);
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
}

/*!
 * @brief Sets the PWM submodule fractional value register value.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister        Fractional value register index (range in 1~5), see @ref pwm_sm_fracval_register_t.
 *
 * @return The VALn FRACVALn value.
 */
static inline uint16_t PWM_GetFracvalRegister(PWM_Type *base,
                                              pwm_sm_number_t eSubModule,
                                              pwm_sm_fracval_register_t eRegister)
{
    uint16_t u16Regs = 0U;
    switch (eRegister)
    {
        case kPWM_FRACVAL1:
            u16Regs = (base->SM[eSubModule].FRACVAL1 & PWM_FRACVAL1_FRACVAL1_MASK) >> PWM_FRACVAL1_FRACVAL1_SHIFT;
            break;
        case kPWM_FRACVAL2:
            u16Regs = (base->SM[eSubModule].FRACVAL2 & PWM_FRACVAL2_FRACVAL2_MASK) >> PWM_FRACVAL2_FRACVAL2_SHIFT;
            break;
        case kPWM_FRACVAL3:
            u16Regs = (base->SM[eSubModule].FRACVAL3 & PWM_FRACVAL3_FRACVAL3_MASK) >> PWM_FRACVAL3_FRACVAL3_SHIFT;
            break;
        case kPWM_FRACVAL4:
            u16Regs = (base->SM[eSubModule].FRACVAL4 & PWM_FRACVAL4_FRACVAL4_MASK) >> PWM_FRACVAL4_FRACVAL4_SHIFT;
            break;
        case kPWM_FRACVAL5:
            u16Regs = (base->SM[eSubModule].FRACVAL5 & PWM_FRACVAL5_FRACVAL5_MASK) >> PWM_FRACVAL5_FRACVAL5_SHIFT;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
    return u16Regs;
}

/*!
 * @brief Set submodule register VALx and its FRAC value with 32bit access.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       Submodule ID.
 * @param eRegister        Fractional value register index (range in 1~5), see @ref pwm_sm_fracval_register_t.
 * @param u32Value         32bit value for VALx and its FRAC.
 *                         VALx: BIT16~BIT31.
 *                         FRACVALx: BIT11~BIT15.
 *                         RESERVED: BIT10~BIT0.
 */
static inline void PWM_SetValueAndFracRegister(PWM_Type *base,
                                               pwm_sm_number_t eSubModule,
                                               pwm_sm_fracval_register_t eRegister,
                                               uint32_t u32Value)
{
    switch (eRegister)
    {
        case kPWM_FRACVAL1:
            *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL1))) = u32Value;
            break;
        case kPWM_FRACVAL2:
            *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL2))) = u32Value;
            break;
        case kPWM_FRACVAL3:
            *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL3))) = u32Value;
            break;
        case kPWM_FRACVAL4:
            *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL4))) = u32Value;
            break;
        case kPWM_FRACVAL5:
            *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL5))) = u32Value;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
}

/*!
 * @brief Get submodule register VALx and its FRAC value with 32bit access.
 *
 * @param base             PWM peripheral base address.
 * @param eSubModule       Submodule ID.
 * @param eRegister        Fractional value register index (range in 1~5), see @ref pwm_sm_fracval_register_t.
 *
 * @return The value of submodule register VALx and its FRAC, combined into 32bit.
 *         VALx: BIT16~BIT31.
 *         FRACVALx: BIT11~BIT15.
 *         RESERVED: BIT10~BIT0.
 */
static inline uint32_t PWM_GetValueAndFracRegister(PWM_Type *base,
                                                   pwm_sm_number_t eSubModule,
                                                   pwm_sm_fracval_register_t eRegister)
{
    uint32_t u32Regs = 0U;
    switch (eRegister)
    {
        case kPWM_FRACVAL1:
            u32Regs = *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL1)));
            break;
        case kPWM_FRACVAL2:
            u32Regs = *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL2)));
            break;
        case kPWM_FRACVAL3:
            u32Regs = *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL3)));
            break;
        case kPWM_FRACVAL4:
            u32Regs = *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL4)));
            break;
        case kPWM_FRACVAL5:
            u32Regs = *((volatile uint32_t *)(&(base->SM[eSubModule].FRACVAL5)));
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
    return u32Regs;
}

#endif
/*!
 * @brief Set the PWM LDOK bit on a single or multiple submodules.
 *
 * Enable this feature can make buffered CTRL[PRSC] and the INIT, FRACVAL and VAL registers values take effect after
 * next local load signal assert. The timing of take effect can be the next PWM reload or immediately. After loading,
 * MCTRL[LDOK] is automatically cleared and need to enable again before the next register updated.
 *
 * @note The VALx, FRACVALx,INIT, and CTRL[PRSC] registers of the corresponding submodule cannot be written
 *       while the the corresponding MCTRL[LDOK] bit is set.
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16Mask      PWM submodules to set the LDOK bit, Logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_SetPwmLdok(PWM_Type *base, uint16_t u16Mask)
{
    base->MCTRL |= PWM_MCTRL_LDOK(u16Mask);
}

/*!
 * @brief Clear the PWM LDOK bit on a single or multiple submodules.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16Mask      PWM submodules to clear the LDOK bit, Logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_ClearPwmLdok(PWM_Type *base, uint16_t u16Mask)
{
    base->MCTRL &= ~PWM_MCTRL_CLDOK(u16Mask);
}

/*!
 * brief Sets up the PWM submodule force logic configure.
 *
 * param base         PWM peripheral base address.
 * param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig     Poniter to submodule force logic configure structure, see @ref pwm_sm_force_logic_config_t.
 */
static inline void PWM_SetupForceLogicConfig(PWM_Type *base,
                                             pwm_sm_number_t eSubModule,
                                             const pwm_sm_force_logic_config_t *psConfig)
{
    if (eSubModule == kPWM_SubModule0)
    {
        base->SWCOUT = (uint16_t)(base->SWCOUT & ~(PWM_SWCOUT_SM0OUT45_MASK | PWM_SWCOUT_SM0OUT23_MASK)) |
                       PWM_SWCOUT_SM0OUT45(psConfig->eSoftOutputFor45) |
                       PWM_SWCOUT_SM0OUT23(psConfig->eSoftOutputFor23);
        base->DTSRCSEL = (uint16_t)(base->DTSRCSEL & ~(PWM_DTSRCSEL_SM0SEL45_MASK | PWM_DTSRCSEL_SM0SEL23_MASK)) |
                         PWM_DTSRCSEL_SM0SEL45(psConfig->eForceOutput23) |
                         PWM_DTSRCSEL_SM0SEL23(psConfig->eForceOutput45);
    }
    else if (eSubModule == kPWM_SubModule1)
    {
        base->SWCOUT = (uint16_t)(base->SWCOUT & ~(PWM_SWCOUT_SM1OUT45_MASK | PWM_SWCOUT_SM1OUT23_MASK)) |
                       PWM_SWCOUT_SM1OUT45(psConfig->eSoftOutputFor45) |
                       PWM_SWCOUT_SM1OUT23(psConfig->eSoftOutputFor23);
        base->DTSRCSEL = (uint16_t)(base->DTSRCSEL & ~(PWM_DTSRCSEL_SM1SEL45_MASK | PWM_DTSRCSEL_SM1SEL23_MASK)) |
                         PWM_DTSRCSEL_SM1SEL45(psConfig->eForceOutput23) |
                         PWM_DTSRCSEL_SM1SEL23(psConfig->eForceOutput45);
    }
    else if (eSubModule == kPWM_SubModule2)
    {
        base->SWCOUT = (uint16_t)(base->SWCOUT & ~(PWM_SWCOUT_SM2OUT45_MASK | PWM_SWCOUT_SM2OUT23_MASK)) |
                       PWM_SWCOUT_SM2OUT45(psConfig->eSoftOutputFor45) |
                       PWM_SWCOUT_SM2OUT23(psConfig->eSoftOutputFor23);
        base->DTSRCSEL = (uint16_t)(base->DTSRCSEL & ~(PWM_DTSRCSEL_SM2SEL45_MASK | PWM_DTSRCSEL_SM2SEL23_MASK)) |
                         PWM_DTSRCSEL_SM2SEL45(psConfig->eForceOutput23) |
                         PWM_DTSRCSEL_SM2SEL23(psConfig->eForceOutput45);
    }
    else
    {
        base->SWCOUT = (uint16_t)(base->SWCOUT & ~(PWM_SWCOUT_SM3OUT45_MASK | PWM_SWCOUT_SM3OUT23_MASK)) |
                       PWM_SWCOUT_SM3OUT45(psConfig->eSoftOutputFor45) |
                       PWM_SWCOUT_SM3OUT23(psConfig->eSoftOutputFor23);
        base->DTSRCSEL = (uint16_t)(base->DTSRCSEL & ~(PWM_DTSRCSEL_SM3SEL45_MASK | PWM_DTSRCSEL_SM3SEL23_MASK)) |
                         PWM_DTSRCSEL_SM3SEL45(psConfig->eForceOutput23) |
                         PWM_DTSRCSEL_SM3SEL23(psConfig->eForceOutput45);
    }

