nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
    base->SM[eSubModule].CTRL2 = (base->SM[eSubModule].CTRL2 & ~(uint16_t)(PWM_CTRL2_FORCE_SEL_MASK)) |
                                 PWM_CTRL2_FORCE_SEL(psConfig->eForceSignalSelect);
}

/*!
 * @brief Sets up the PWM Sub-Module to trigger a software FORCE_OUT event.
 *
 * @note Only works when the CTRL2[FORCE_SEL] select kPWM_ForceOutOnLocalSoftware.
 *
 * @param base         PWM peripheral base address.
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 */
static inline void PWM_SetSoftwareForce(PWM_Type *base, pwm_sm_number_t eSubModule)
{
    base->SM[eSubModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
}

/*!
 * @brief Sets up the PWM submodule deadtime logic configure.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig      Pointer to deadtime logic configure structure, see @ref pwm_sm_deadtime_logic_config_t.
 */
void PWM_SetupDeadtimeConfig(PWM_Type *base,
                             pwm_sm_number_t eSubModule,
                             const pwm_sm_deadtime_logic_config_t *psConfig);

/*!
 * @brief Get the sampled values of the PWM_X input at the end of each deadtime.
 *
 * When use PWM_A/B in complementary mode and connect to transistor to controls the output voltage. Need insert deadtime
 * to avoid overlap of conducting interval between the top and bottom transistor. And both transistors in complementary
 * mode are off during deadtime. Then connect the PWM_X input to complementary transistors output, then it sampling
 * input at the end of deadtime 0 for DT[0] and the end of deadtime 1 for DT[1]. Which DT value is not 0 indicates that
 * there is a problem with the corresponding deadtime value. This can help to decide if there need do a deadtime
 * correction for current complementary PWM output.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 *
 * @return The PWM_X input sampled values.
 */
static inline uint16_t PWM_GetDeadtimeSampleValue(PWM_Type *base, pwm_sm_number_t eSubModule)
{
    return (base->SM[eSubModule].CTRL & PWM_CTRL_DT_MASK) >> PWM_CTRL_DT_SHIFT;
}

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
/*!
 * @brief Sets up the PWM submodule fractional delay logic configure.
 *
 * @note The fractional delay logic can only be used when the IPBus clock is running at 100 MHz.
 *
 * @param base         PWM peripheral base address.
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig     Pointer to fractional delay logic configure structure, see
 *                      @ref pwm_sm_fractional_delay_logic_config_t.
 */
void PWM_SetupFractionalDelayConfig(PWM_Type *base,
                                    pwm_sm_number_t eSubModule,
                                    const pwm_sm_fractional_delay_logic_config_t *psConfig);
#endif

/*!
 * @brief Sets up the PWM submodule output logic configure.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig      Pointer to output logic configure structure, see @ref pwm_sm_output_logic_config_t.
 */
void PWM_SetupOutputConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_output_logic_config_t *psConfig);

/*!
 * @brief Enables the PWM submodule pin output.
 *
 * This function handles PWMX_EN/PWMA_EN/PWMB_EN bit filed of OUTEN register, whcih can enable one or more submodule
 * pin in PWMX/A/B.
 *
 * @param base               PWM peripheral base address
 * @param u16SubModules      The submodules that enable eOutput output, logical OR of @ref _pwm_sm_enable.
 * @param eOutput            PWM output pin ID, see @ref pwm_sm_pwm_out_t.
 */
static inline void PWM_EnableOutput(PWM_Type *base, uint16_t u16SubModules, pwm_sm_pwm_out_t eOutput)
{
    base->OUTEN |= ((uint16_t)u16SubModules) << (4U * ((uint16_t)eOutput));
}

/*!
 * @brief Disables the PWM submodule pin output.
 *
 * This function handles PWMX_EN/PWMA_EN/PWMB_EN bit filed of OUTEN register, whcih can disable one or more submodule
 * pin in PWMX/A/B.
 *
 * @param base               PWM peripheral base address
 * @param u16SubModules      The submodules that disable eOutput output, logical OR of @ref _pwm_sm_enable.
 * @param eOutput            PWM output pin ID, see @ref pwm_sm_pwm_out_t.
 */
static inline void PWM_DisableOutput(PWM_Type *base, uint16_t u16SubModules, pwm_sm_pwm_out_t eOutput)
{
    base->OUTEN &= ~(((uint16_t)u16SubModules) << (4U * ((uint16_t)eOutput)));
}

/*!
 * @brief Enables the PWM pin combination output.
 *
 * This function handles PWMX_EN/PWMA_EN/PWMB_EN bit filed of OUTEN register at the same time.
 *
 * @param base                 PWM peripheral base address
 * @param u16XSubModules       The submodules that enable PWMX output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16ASubModules       The submodules that enable PWMA output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16BSubModules       The submodules that enable PWMB output, should be logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_EnableCombinedOutput(PWM_Type *base,
                                            uint16_t u16XSubModules,
                                            uint16_t u16ASubModules,
                                            uint16_t u16BSubModules)
{
    base->OUTEN |=
        PWM_OUTEN_PWMA_EN(u16ASubModules) | PWM_OUTEN_PWMB_EN(u16BSubModules) | PWM_OUTEN_PWMX_EN(u16XSubModules);
}

/*!
 * @brief Disables the PWM pin combination output.
 *
 * This function handles PWMX_EN/PWMA_EN/PWMB_EN bit filed of OUTEN register at the same time.
 *
 * @param base                 PWM peripheral base address
 * @param u16XSubModules       The submodules that disable PWMX output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16ASubModules       The submodules that disable PWMA output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16BSubModules       The submodules that disable PWMB output, should be logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_DisableCombinedOutput(PWM_Type *base,
                                             uint16_t u16XSubModules,
                                             uint16_t u16ASubModules,
                                             uint16_t u16BSubModules)
{
    base->OUTEN &=
        ~(PWM_OUTEN_PWMA_EN(u16ASubModules) | PWM_OUTEN_PWMB_EN(u16BSubModules) | PWM_OUTEN_PWMX_EN(u16XSubModules));
}

/*!
 * @brief Mask the PWM pin output.
 *
 * This function handles MASKA/MASKB/MASKX bit filed of MASK register, which can mask one or more submodule
 * pin in PWMX/A/B.
 *
 * @note The mask bits is buffered and can be updated until a FORCE_OUT event occurs or a software update command.
 *
 * @param base             PWM peripheral base address.
 * @param u16SubModules    The submodules that mask eOutput output, logical OR of @ref _pwm_sm_enable.
 * @param eOutput          PWM output pin ID, see @ref pwm_sm_pwm_out_t.
 */
static inline void PWM_MaskOutput(PWM_Type *base, uint16_t u16SubModules, pwm_sm_pwm_out_t eOutput)
{
    /* Mask output immediate */
    base->MASK |= ((uint16_t)u16SubModules) << (4U * ((uint16_t)eOutput)) | PWM_MASK_UPDATE_MASK(u16SubModules);
}

/*!
 * @brief Unmask the PWM pin output.
 *
 * This function handles MASKA/MASKB/MASKX bit filed of MASK register, which can mask one or more submodule
 * pin in PWMX/A/B.
 *
 * @note The mask bits is buffered and can be updated until a FORCE_OUT event occurs or a software update command.
 *
 * @param base              PWM peripheral base address
 * @param u16SubModules     The submodules that unmask eOutput output, logical OR of @ref _pwm_sm_enable.
 * @param eOutput           PWM output pin ID, see @ref pwm_sm_pwm_out_t.
 */
static inline void PWM_UnmaskOutput(PWM_Type *base, uint16_t u16SubModules, pwm_sm_pwm_out_t eOutput)
{
    /* Unmask output immediate */
    base->MASK &= ~((uint16_t)u16SubModules) << (4U * ((uint16_t)eOutput)) | PWM_MASK_UPDATE_MASK(u16SubModules);
}

/*!
 * @brief Mask the PWM pin combination output.
 *
 * This function handles MASKA/MASKB/MASKX bit filed of MASK register at the same time.
 *
 * @note The mask bits is buffered and can be updated until a FORCE_OUT event occurs or a software update command.
 *
 *
 * @param base               PWM peripheral base address
 * @param u16XSubModules     The submodules that mask PWMX output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16ASubModules     The submodules that mask PWMA output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16BSubModules     The submodules that mask PWMB output, should be logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_MaskCombinedOutput(PWM_Type *base,
                                          uint16_t u16XSubModules,
                                          uint16_t u16ASubModules,
                                          uint16_t u16BSubModules)
{
    /* Mask output immediate */
    base->MASK |= PWM_MASK_MASKA(u16ASubModules) | PWM_MASK_MASKB(u16BSubModules) | PWM_MASK_MASKX(u16XSubModules) |
                  PWM_MASK_UPDATE_MASK(u16ASubModules | u16BSubModules | u16XSubModules);
}

/*!
 * @brief Unmask the PWM pin combination output.
 *
 * This function handles MASKA/MASKB/MASKX bit filed of MASK register at the same time.
 *
 * @note The mask bits is buffered and can be updated until a FORCE_OUT event occurs or a software update command.
 *
 *
 * @param base                 PWM peripheral base address
 * @param u16XSubModules     The submodules that unmask PWMX output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16ASubModules     The submodules that unmask PWMA output, should be logical OR of @ref _pwm_sm_enable.
 * @param u16BSubModules     The submodules that unmask PWMB output, should be logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_UnmaskCombinedOutput(PWM_Type *base,
                                            uint16_t u16XSubModules,
                                            uint16_t u16ASubModules,
                                            uint16_t u16BSubModules)
{
    /* Unmask output immediate */
    base->MASK &= ~(PWM_MASK_MASKA(u16ASubModules) | PWM_MASK_MASKB(u16BSubModules) | PWM_MASK_MASKX(u16XSubModules) |
                    PWM_MASK_UPDATE_MASK(u16ASubModules | u16BSubModules | u16XSubModules));
}

/*!
 * @brief Update PWM output mask bits immediately with a software command.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 */
static inline void PWM_UpdateMask(PWM_Type *base, pwm_sm_number_t eSubModule)
{
    base->MASK |= PWM_MASK_UPDATE_MASK((uint16_t)1U << (uint16_t)eSubModule);
}
/*!
 * @brief Enables/Disables the PWM submodule continue to run while the chip is in DEBUG mode.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param bEnable      Enable the feature or not.
 *                     - \b true Enable load feature.
 *                     - \b false Disable load feature.
 */
static inline void PWM_EnablePwmRunInDebug(PWM_Type *base, pwm_sm_number_t eSubModule, bool bEnable)
{
    if (bEnable)
    {
        base->SM[eSubModule].CTRL2 |= (uint16_t)PWM_CTRL2_DBGEN_MASK;
    }
    else
    {
        base->SM[eSubModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_DBGEN_MASK;
    }
}

/*!
 * @brief Enables/Disables the PWM submodule continue to run while the chip is in WAIT mode.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param bEnable      Enable the feature or not.
 *                     - \b true Enable load feature.
 *                     - \b false Disable load feature.
 */
static inline void PWM_EnablePwmRunInWait(PWM_Type *base, pwm_sm_number_t eSubModule, bool bEnable)
{
    if (bEnable)
    {
        base->SM[eSubModule].CTRL2 |= (uint16_t)PWM_CTRL2_WAITEN_MASK;
    }
    else
    {
        base->SM[eSubModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_WAITEN_MASK;
    }
}

/*!
 * @brief Starts the PWM submodule counter for a single or multiple submodules.
 *
 * Sets the Run bit which enables the clocks to the PWM submodule. This function can start multiple
 * submodules at the same time.
 *
 * @param base      PWM peripheral base address
 * @param u16Mask   PWM submodules to start run, Logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_EnableCounters(PWM_Type *base, uint16_t u16Mask)
{
    base->MCTRL |= PWM_MCTRL_RUN(u16Mask);
}

/*!
 * @brief Stops the PWM counter for a single or multiple submodules.
 *
 * Clears the Run bit which resets the submodule's counter. This function can stop multiple
 * submodules at the same time.
 *
 * @param base      PWM peripheral base address
 * @param u16Mask   PWM submodules to start run, Logical OR of @ref _pwm_sm_enable.
 */
static inline void PWM_DisableCounters(PWM_Type *base, uint16_t u16Mask)
{
    base->MCTRL &= ~(PWM_MCTRL_RUN(u16Mask));
}

/*! @}*/

/*!
 * @name Submodule Input Capture Related Interfaces
 * @{
 */

/*!
 * @brief Reads PWM submodule input capture value register.
 *
 * This function read the CVALn register value, stores the value captured from the submodule counter.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister     PWM submodule input capture value register, see @ref pwm_sm_input_capture_register_t.
 *
 * @return The input capture value.
 */
static inline uint16_t PWM_GetCaptureValue(PWM_Type *base,
                                           pwm_sm_number_t eSubModule,
                                           pwm_sm_input_capture_register_t eRegister)
{
    return (&base->SM[eSubModule].CVAL0)[(uint16_t)eRegister];
}

/*!
 * @brief Reads PWM submodule input capture value cycle register.
 *
 * This function read the CVALnCYC register value, stores the cycle number corresponding to the value captured in
 * CVALn. This register is incremented each time the counter is loaded with the INIT value at the end of a PWM
 * modulo cycle.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eRegister     PWM submodule input capture value register, see @ref pwm_sm_input_capture_register_t.
 *
 * @return The input capture register cycle value.
 */
static inline uint16_t PWM_GetCaptureValueCycle(PWM_Type *base,
                                                pwm_sm_number_t eSubModule,
                                                pwm_sm_input_capture_register_t eRegister)
{
    return (&base->SM[eSubModule].CVAL0CYC)[(uint16_t)eRegister];
}

/*!
 * @brief Reads the PWM submodule input capture logic edge counter value.
 *
 * Each input capture logic has a edge counter, which counts both the rising and falling edges of
 * the input capture signal and it compare signal can select as input capture trigger source.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eInputPin     PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 */

static inline uint16_t PWM_GetCaptureEdgeCounterVaule(PWM_Type *base,
                                                      pwm_sm_number_t eSubModule,
                                                      pwm_sm_input_capture_pin_t eInputPin)
{
    uint16_t u16Regs;

    if (eInputPin == kPWM_InputCapturePwmX)
    {
        u16Regs = (base->SM[eSubModule].CAPTCOMPX & PWM_CAPTCOMPX_EDGCNTX_MASK) >> PWM_CAPTCOMPX_EDGCNTX_SHIFT;
    }
    else if (eInputPin == kPWM_InputCapturePwmA)
    {
        u16Regs = (base->SM[eSubModule].CAPTCOMPA & PWM_CAPTCOMPA_EDGCNTA_MASK) >> PWM_CAPTCOMPA_EDGCNTA_SHIFT;
    }
    else
    {
        u16Regs = (base->SM[eSubModule].CAPTCOMPB & PWM_CAPTCOMPB_EDGCNTB_MASK) >> PWM_CAPTCOMPB_EDGCNTB_SHIFT;
    }

    return u16Regs;
}

/*!
 * @brief Sets up the PWM submodule input capture configure.
 *
 * Each PWM submodule has 3 pins that can be configured for use as input capture pins. This function
 * sets up the capture parameters for each pin and enables the input capture operation.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eInputPin     PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 * @param psConfig      Pointer to input capture configure structure, see @ref pwm_sm_input_capture_config_t.
 */
void PWM_SetupInputCaptureConfig(PWM_Type *base,
                                 pwm_sm_number_t eSubModule,
                                 pwm_sm_input_capture_pin_t eInputPin,
                                 const pwm_sm_input_capture_config_t *psConfig);
/*!
 * @brief Enables the PWM submodule input capture operation.
 *
 * Enables input capture operation will start the input capture process. The enable bit is self-cleared when in one shot
 * mode and one or more of the enabled capture circuits has had a capture event.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eInputPin     PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 */
static inline void PWM_EnableInputCapture(PWM_Type *base,
                                          pwm_sm_number_t eSubModule,
                                          pwm_sm_input_capture_pin_t eInputPin)
{
    if (eInputPin == kPWM_InputCapturePwmA)
    {
        base->SM[eSubModule].CAPTCTRLA |= PWM_CAPTCTRLA_ARMA_MASK;
    }
    else if (eInputPin == kPWM_InputCapturePwmB)
    {
        base->SM[eSubModule].CAPTCTRLB |= PWM_CAPTCTRLB_ARMB_MASK;
    }
    else
    {
        base->SM[eSubModule].CAPTCTRLX |= PWM_CAPTCTRLX_ARMX_MASK;
    }
}

/*!
 * @brief Disables the PWM submodule input capture operation.
 *
 * The enable bit can be cleared at any time to disable input capture operation.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param eInputPin     PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 */
static inline void PWM_DisableInputCapture(PWM_Type *base,
                                           pwm_sm_number_t eSubModule,
                                           pwm_sm_input_capture_pin_t eInputPin)
{
    if (eInputPin == kPWM_InputCapturePwmA)
    {
        base->SM[eSubModule].CAPTCTRLA &= ~(uint16_t)PWM_CAPTCTRLA_ARMA_MASK;
    }
    else if (eInputPin == kPWM_InputCapturePwmB)
    {
        base->SM[eSubModule].CAPTCTRLB &= ~(uint16_t)PWM_CAPTCTRLB_ARMB_MASK;
    }
    else
    {
        base->SM[eSubModule].CAPTCTRLX &= ~(uint16_t)PWM_CAPTCTRLX_ARMX_MASK;
    }
}

/*!
 * @brief Get the logic value currently being driven into the PWM inputs.
 *
 * @param base         PWM peripheral base address
 * @param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * @param eInputPin    PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 *
 * @return The PWM submodule input capture pin logic value.
 */
static inline uint16_t PWM_GetInputValue(PWM_Type *base,
                                         pwm_sm_number_t eSubModule,
                                         pwm_sm_input_capture_pin_t eInputPin)
{
    uint16_t u16Reg;
    if (eInputPin == kPWM_InputCapturePwmA)
    {
        u16Reg = (base->SM[eSubModule].OCTRL & PWM_OCTRL_PWMA_IN_MASK) >> PWM_OCTRL_PWMA_IN_SHIFT;
    }
    else if (eInputPin == kPWM_InputCapturePwmB)
    {
        u16Reg = (base->SM[eSubModule].OCTRL & PWM_OCTRL_PWMB_IN_MASK) >> PWM_OCTRL_PWMB_IN_SHIFT;
    }
    else
    {
        u16Reg = (base->SM[eSubModule].OCTRL & PWM_OCTRL_PWMX_IN_MASK) >> PWM_OCTRL_PWMX_IN_SHIFT;
    }
    return u16Reg;
}

/*! @}*/

/*!
 * @name Fault Protection Channel Related Interfaces
 * @{
 */

/*!
 * @brief Sets up the PWM fault protection channel configure.
 *
 * @param base                PWM peripheral base address.
 * @param eFaultProtection    PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * @param psConfig            Pointer to fault protection channel configure structure, see @ref
 * pwm_fault_protection_config_t.
 */
void PWM_SetupFaultProtectionConfig(PWM_Type *base,
                                    pwm_fault_protection_channel_t eFaultProtection,
                                    const pwm_fault_protection_config_t *psConfig);

