nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.h
/*!
 * @brief Mapping fault protection channel fault input status to PWM submodule output,
 *
 * @note Each PWM output can be mapping anyone or more fault inputs. The mapped fault protection channel inputs can
 *       disable PWM output.
 *
 * @param base               PWM peripheral base address.
 * @param eSubModule         PWM submodule number, see @ref pwm_sm_number_t.
 * @param ePwmOutput         PWM submodule output, see @ref pwm_sm_pwm_out_t.
 * @param psMapping          The fault input disable mapping structure, see @ref pwm_sm_fault_input_mapping_t.
 */
static inline void PWM_SetupSMFaultInputMapping(PWM_Type *base,
                                                pwm_sm_number_t eSubModule,
                                                pwm_sm_pwm_out_t ePwmOutput,
                                                const pwm_sm_fault_input_mapping_t *psMapping)
{
    if (ePwmOutput == kPWM_PwmA)
    {
        base->SM[eSubModule].DISMAP[0] = (base->SM[eSubModule].DISMAP[0] & ~(uint16_t)PWM_DISMAP_DIS0A_MASK) |
                                         PWM_DISMAP_DIS0A((uint16_t)psMapping->bFaultInput0Mapping |
                                                          ((uint16_t)psMapping->bFaultInput1Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput2Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput3Mapping << 3U));
        base->SM[eSubModule].DISMAP[1] = (base->SM[eSubModule].DISMAP[1] & ~(uint16_t)PWM_DISMAP_DIS1A_MASK) |
                                         PWM_DISMAP_DIS1A((uint16_t)psMapping->bFaultInput4Mapping |
                                                          ((uint16_t)psMapping->bFaultInput5Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput6Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput7Mapping << 3U));
    }
    else if (ePwmOutput == kPWM_PwmB)
    {
        base->SM[eSubModule].DISMAP[0] = (base->SM[eSubModule].DISMAP[0] & ~(uint16_t)PWM_DISMAP_DIS0B_MASK) |
                                         PWM_DISMAP_DIS0B((uint16_t)psMapping->bFaultInput0Mapping |
                                                          ((uint16_t)psMapping->bFaultInput1Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput2Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput3Mapping << 3U));
        base->SM[eSubModule].DISMAP[1] = (base->SM[eSubModule].DISMAP[1] & ~(uint16_t)PWM_DISMAP_DIS1B_MASK) |
                                         PWM_DISMAP_DIS1B((uint16_t)psMapping->bFaultInput4Mapping |
                                                          ((uint16_t)psMapping->bFaultInput5Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput6Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput7Mapping << 3U));
    }
    else
    {
        base->SM[eSubModule].DISMAP[0] = (base->SM[eSubModule].DISMAP[0] & ~(uint16_t)PWM_DISMAP_DIS0X_MASK) |
                                         PWM_DISMAP_DIS0X((uint16_t)psMapping->bFaultInput0Mapping |
                                                          ((uint16_t)psMapping->bFaultInput1Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput2Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput3Mapping << 3U));
        base->SM[eSubModule].DISMAP[1] = (base->SM[eSubModule].DISMAP[1] & ~(uint16_t)PWM_DISMAP_DIS1X_MASK) |
                                         PWM_DISMAP_DIS1X((uint16_t)psMapping->bFaultInput4Mapping |
                                                          ((uint16_t)psMapping->bFaultInput5Mapping << 1U) |
                                                          ((uint16_t)psMapping->bFaultInput6Mapping << 2U) |
                                                          ((uint16_t)psMapping->bFaultInput7Mapping << 3U));
    }
}

/*! @}*/

/*!
 * @name DMA Control Interfaces
 * @{
 */

/*!
 * @brief Sets up the PWM submodule DMA configure.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param psConfig      Pointer to PWM submodule DMA configure, see @ref pwm_sm_dma_config_t.
 */
void PWM_SetupDmaConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_dma_config_t *psConfig);

/*!
 * @brief Select the trigger source for enabled capture FIFOs DMA read request.
 *
 * @note This function only can be used when the bEnableCaptureDMA be true.
 *
 * @param base          PWM peripheral base address.
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16Mask       The PWM submodule DMA requests to enable. Logical OR of @ref _pwm_sm_dma_enable.
 */
static inline void PWM_SetEnabledCaptureDmaSource(PWM_Type *base,
                                                  pwm_sm_number_t eSubModule,
                                                  pwm_sm_capture_dma_source_t eCaptureDmaSource)
{
    base->SM[eSubModule].DMAEN =
        (base->SM[eSubModule].DMAEN & ~(uint16_t)(PWM_DMAEN_FAND_MASK | PWM_DMAEN_CAPTDE_MASK)) |
        ((uint16_t)(eCaptureDmaSource) << PWM_DMAEN_CAPTDE_SHIFT);
}

/*! @}*/

/*!
 * @name Interrupts Interface
 * @{
 */

/*!
 * @brief Enables the PWM submodule interrupts according to a provided mask.
 *
 * This examples shows how to enable VAL 0 compare interrupt and VAL 1 compare interrupt.
 * @code
 *      PWM_EnableSMInterrupts(PWM, kPWM_SubModule0, kPWM_CompareVal0InterruptEnable |
 *      kPWM_CompareVal1InterruptEnable);
 * @endcode
 *
 * @param base          PWM peripheral base address
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16Mask       The PWM submodule interrupts to enable. Logical OR of @ref _qtmr_channel_interrupt_enable.
 */
static inline void PWM_EnableSMInterrupts(PWM_Type *base, pwm_sm_number_t eSubModule, uint16_t u16Mask)
{
    base->SM[eSubModule].INTEN |= u16Mask;
}

/*!
 * @brief Disables the PWM submodule interrupts according to a provided mask.
 *
 * This examples shows how to disable VAL 0 compare interrupt and VAL 1 compare interrupt.
 * @code
 *      PWM_DisbaleSMInterrupts(PWM, kPWM_SubModule0, kPWM_CompareVal0InterruptEnable |
 *      kPWM_CompareVal1InterruptEnable);
 * @endcode
 *
 * @param base          PWM peripheral base address
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param u16Mask       The PWM submodule interrupts to enable. Logical OR of @ref _qtmr_channel_interrupt_enable.
 */
static inline void PWM_DisbaleSMInterrupts(PWM_Type *base, pwm_sm_number_t eSubModule, uint16_t u16Mask)
{
    base->SM[eSubModule].INTEN &= ~u16Mask;
}

/*!
 * @brief Enables the PWM fault protection channel interrupt according to a provided mask.
 *
 * This examples shows how to enable fault pin 0 interrupt and fault pin 1 interrupt.
 * @code
 *      PWM_EnableFaultInterrupts(PWM, kPWM_FaultProtection0, kPWM_Fault0InterruptEnable |
 *      kPWM_Fault1InterruptEnable);
 * @endcode
 *
 * @param base              PWM peripheral base address
 * @param eFaultProtection  PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * @param u16Mask           The PWM fault protection channel interrupts to enable. Logical OR of @ref
 *                          _pwm_fault_protection_interrupt_enable.
 */
static inline void PWM_EnableFaultInterrupts(PWM_Type *base,
                                             pwm_fault_protection_channel_t eFaultProtection,
                                             uint16_t u16Mask)
{
    base->FAULT[eFaultProtection].FCTRL |= u16Mask;
}

/*!
 * @brief Disables the PWM fault protection channel interrupt according to a provided mask.
 *
 * This examples shows how to disable fault pin 0 interrupt and fault pin 1 interrupt.
 * @code
 *      PWM_DisableFaultInterrupts(PWM, kPWM_FaultProtection0, kPWM_Fault0InterruptEnable |
 *      kPWM_Fault1InterruptEnable);
 * @endcode
 *
 * @param base              PWM peripheral base address
 * @param eFaultProtection  PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * @param u16Mask           The PWM fault protection channel interrupts to disable. Logical OR of @ref
 *                          _pwm_fault_protection_interrupt_enable.
 */
static inline void PWM_DisableFaultInterrupts(PWM_Type *base,
                                              pwm_fault_protection_channel_t eFaultProtection,
                                              uint16_t u16Mask)
{
    base->FAULT[eFaultProtection].FCTRL &= ~u16Mask;
}

/*! @}*/

/*!
 * @name Status Flag Interfaces
 * @{
 */

/*!
 * @brief Gets the PWM submodule status flags.
 *
 * This examples shows how to check whether the submodule VAL0 compare flag set.
 * @code
 *      if((PWM_GetSMStatusFlags(PWM, kPWM_SubModule0) & kPWM_CompareVal0Flag) != 0U)
 *      {
 * 	        ...
 *      }
 * @endcode
 *
 * @param base          PWM peripheral base address
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 *
 * @return The PWM submodule status flags. This is the logical OR of @ref _pwm_sm_status_flags.
 */

static inline uint16_t PWM_GetSMStatusFlags(PWM_Type *base, pwm_sm_number_t eSubModule)
{
    return base->SM[eSubModule].STS;
}

/*!
 * @brief Clears the PWM submodule status flags.
 *
 * @note The kPWM_RegUpdatedFlag can't be cleared by software.
 *
 * This examples shows how to clear the submodule VAL0 compare flag.
 * @code
 *      PWM_ClearSMStatusFlags(PWM, kPWM_SubModule0, kPWM_CompareVal0Flag);
 * @endcode
 * @param base          PWM peripheral base address
 * @param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * @param u8Mask        The status flags to clear. This is the logical OR of @ref _pwm_sm_status_flags.
 */
static inline void PWM_ClearSMStatusFlags(PWM_Type *base, pwm_sm_number_t eSubModule, uint16_t u16Mask)
{
    base->SM[eSubModule].STS &= ~u16Mask;
}

/*!
 * @brief Enables the PWM fault protection channel interrupt according to a provided mask.
 *
 * This examples shows how to check whether the fault protection channel fault input pin 0 set.
 * @code
 *      if((PWM_GetFaultStatusFlags(PWM, kPWM_FaultProtection0) & kPWM_FaultPin0Flag) != 0U)
 *      {
 * 	        ...
 *      }
 * @endcode
 *
 * @param base              PWM peripheral base address
 * @param eFaultProtection  PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * @return The PWM fault protection channel status flags. This is the logical OR of @ref
 * _pwm_fault_protection_status_flags.
 */
static inline uint16_t PWM_GetFaultStatusFlags(PWM_Type *base, pwm_fault_protection_channel_t eFaultProtection)
{
    return base->FAULT[eFaultProtection].FSTS;
}

/*!
 * @brief Disables the PWM fault protection channel interrupt according to a provided mask.
 *
 * @note The kPWM_FaultPin0Flag ~ kPWM_FaultPin3Flag can't be cleared by software.
 *
 * This examples shows how to clear the fault protection channel fault 0 flag.
 * @code
 *      PWM_ClearFaultStatusFlags(PWM, kPWM_FaultProtection0, kPWM_Fault0Flag);
 * @endcode
 *
 * @param base              PWM peripheral base address
 * @param eFaultProtection  PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * @param u16Mask           The PWM fault protection channel interrupts to disable. Logical OR of @ref
 *                          _pwm_fault_protection_interrupt_enable.
 */
static inline void PWM_ClearFaultStatusFlags(PWM_Type *base,
                                             pwm_fault_protection_channel_t eFaultProtection,
                                             uint16_t u16Mask)
{
    base->FAULT[eFaultProtection].FSTS &= ~u16Mask;
}

/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_PWM_H_ */
